[{"chengyu":"一不做，二不休","pinyin":"yī bù zuò, èr bù xiū","english_explanation":"to carry the thing through, whatever the consequences; in for a penny, in for a pound"},{"chengyu":"一丘之貉","pinyin":"yī qiū zhī hé","english_explanation":"people of the same ilk; birds of a feather"},{"chengyu":"一丝一毫","pinyin":"yīsīyīháo","english_explanation":"a tiny bit; an iota; a trace"},{"chengyu":"一举两得","pinyin":"yī jǔ liǎng dé","english_explanation":"kill two birds with one stone; do one task and finish two or more goals"},{"chengyu":"一了百了","pinyin":"yī liǎo bǎi liǎo","english_explanation":"all troubles end when the main trouble ends"},{"chengyu":"一五一十","pinyin":"yīwǔyīshí","english_explanation":"(of narrating) in full detail他把這件事情一五一十地告訴了我。 (trad.)他把这件事情一五一十地告诉了我。 (simp.)tā bǎ zhè jiàn shìqíng yīwǔyīshí de gàosu wǒHe told me the whole thing in detail."},{"chengyu":"一亩三分地","pinyin":"yī mǔ sān fēn dì","english_explanation":"a tiny piece of land"},{"chengyu":"一人之下，万人之上","pinyin":"yī rén zhī xià, wàn rén zhī shàng","english_explanation":"to occupy a lofty position, second only to the emperor"},{"chengyu":"一介不取","pinyin":"yī jiè bù qǔ","english_explanation":"(of a public servant who is not corrupt) does not take a single penny"},{"chengyu":"一仍旧贯","pinyin":"yī réng jiù guàn","english_explanation":"to follow the old routine"},{"chengyu":"一刀两断","pinyin":"yī dāo liǎng duàn","english_explanation":"to sever at one blow; to make a clean break"},{"chengyu":"一孔之见","pinyin":"yī kǒng zhī jiàn","english_explanation":"a narrow view; a limited outlook"},{"chengyu":"一字不易","pinyin":"yī zì bù yì","english_explanation":"to not change a single word"},{"chengyu":"一字千金","pinyin":"yī zì qiān jīn","english_explanation":"extraordinary writing; uncommonly good writing"},{"chengyu":"一字褒贬","pinyin":"yī zì bāobiǎn","english_explanation":"a concise and deliberate choice of words"},{"chengyu":"一家大小","pinyin":"yī jiā dàxiǎo","english_explanation":"the whole familys 放假了，我们一家大小往乡下去探望祖母。t 放假了，我們一家大小往鄉下去探望祖母。We had a holiday, so our whole family went to the countryside to visit grandmother."},{"chengyu":"一家老小","pinyin":"yī jiā lǎo xiǎo","english_explanation":"the entire family"},{"chengyu":"一干二净","pinyin":"yīgān'èrjìng","english_explanation":"(Advanced Mandarin) thoroughly; completely"},{"chengyu":"一往情深","pinyin":"yīwǎng qíng shēn","english_explanation":"to have a deep and abiding affection for"},{"chengyu":"一心一意","pinyin":"yīxīnyīyì","english_explanation":"heart and soul; wholeheartedly; with great devotion"},{"chengyu":"一成不变","pinyin":"yīchéng bùbiàn","english_explanation":"immutable; unchangeable"},{"chengyu":"一手交钱，一手交货","pinyin":"yī shǒu jiāo qián, yī shǒu jiāo huò","english_explanation":"do things in a simple and direct manner"},{"chengyu":"一手托两家","pinyin":"yī shǒu tuō liǎng jiā","english_explanation":"to serve as an honest broker between two parties"},{"chengyu":"一手遮天","pinyin":"yī shǒu zhē tiān","english_explanation":"to hide the truth (from the public or masses)"},{"chengyu":"一把鼻涕一把泪","pinyin":"yībǎ bítì yībǎ lèi","english_explanation":"tears streaming down one's face"},{"chengyu":"一无是处","pinyin":"yīwúshìchù","english_explanation":"devoid of any merit, good-for-nothing这辆车一无是处，纯粹是废品。Zhè liàng chē yīwúshìchù, chúncuì shì fèipǐn.This car is a no-good piece of junk, pure waste."},{"chengyu":"一日三秋","pinyin":"yī rì sān qiū","english_explanation":"waiting impatiently"},{"chengyu":"一日不见，如隔三秋","pinyin":"yī rì bù jiàn, rú gé sān qiū","english_explanation":"a single day apart seems like three years"},{"chengyu":"一日千里","pinyin":"yī rì qiānlǐ","english_explanation":"to make tremendous progress"},{"chengyu":"一朵鲜花插在牛粪上","pinyin":"yī duǒ xiānhuā chā zài niúfèn shàng","english_explanation":"a beautiful or talented woman who marries an ugly or untalented husband"},{"chengyu":"一概而论","pinyin":"yīgài ér lùn","english_explanation":"(Advanced Mandarin) to treat different matters as the same; to lump together"},{"chengyu":"一模一样","pinyin":"yīmóyīyàng","english_explanation":"exactly the same; identical"},{"chengyu":"一步一回头","pinyin":"yī bù yī huítóu","english_explanation":"to be reluctant or sad to leave a friend or loved one"},{"chengyu":"一毛不拔","pinyin":"yī máo bù bá","english_explanation":"very stingy"},{"chengyu":"一清二楚","pinyin":"yīqīng'èrchù","english_explanation":"perfectly clear; crystal clear; completely unambiguous"},{"chengyu":"一片冰心","pinyin":"yī piàn bīng xīn","english_explanation":"of pure and noble character"},{"chengyu":"一物克一物","pinyin":"yī wù kè yī wù","english_explanation":"there is always one thing to conquer another"},{"chengyu":"一生受用不尽","pinyin":"yī shēng shòu yòng bù jìn","english_explanation":"reap the benefits of something for the rest of one's life他当年对我的一番教导，让我一生受用不尽The guidance and instruction that he gave me in those years is something from which I will reap the benefits for the rest of my life."},{"chengyu":"一盏茶工夫","pinyin":"yī zhǎn chá gōngfu","english_explanation":"within a short period of time"},{"chengyu":"一知半解","pinyin":"yī zhī bàn jiě","english_explanation":"to sort of understand; to only halfway understand; to be unsure of the meaning (of a word or phrase)"},{"chengyu":"一石二鸟","pinyin":"yī shí èr niǎo","english_explanation":"kill two birds with one stone; do one task and finish two or more goals"},{"chengyu":"一箭之地","pinyin":"yī jiàn zhī dì","english_explanation":"a short distance"},{"chengyu":"一箭双雕","pinyin":"yī jiàn shuāng diāo","english_explanation":"kill two birds with one stone; do one task and finish two or more goals."},{"chengyu":"一网打尽","pinyin":"yī wǎng dǎ jìn","english_explanation":"roundup, wholesale arrest; rounding up the herd with one throw"},{"chengyu":"一而二，二而一","pinyin":"yī ér èr, èr ér yī","english_explanation":"one and the same"},{"chengyu":"一脚高一脚低","pinyin":"yī jiǎo gāo yī jiǎo dī","english_explanation":"describes an awkward way of walking"},{"chengyu":"一臂之力","pinyin":"yī bì zhī lì","english_explanation":"a helping hand"},{"chengyu":"一览无余","pinyin":"yī lǎn wú yú","english_explanation":"to take in everything at a glance"},{"chengyu":"一览无遗","pinyin":"yī lǎn wú yí","english_explanation":"to take in everything at a glance"},{"chengyu":"一言九鼎","pinyin":"yī yán jiǔ dǐng","english_explanation":"a solemn promise or pledge"},{"chengyu":"一蹴可几","pinyin":"yī cù kě jī","english_explanation":"(Taiwan) to reach the goal in one step; do it all in one single day2006: anon, PChome online 討論區 (Pchome online Message board)学习过程绝非一蹴可几，甭想一次就记住全部.The learning process is not such that you can just do it all in one single day. Don't think that you will be able to remember everything in one sitting."},{"chengyu":"一蹴而就","pinyin":"yī cù ér jiù","english_explanation":"to reach the goal in one step; happen all at once2004: anon, 外汇管理局表示：人民币汇率改革不会一蹴而就 (Foreign Exchange Bureau announces: the RMB exchange rate reforms will not happen all at once)人民币汇率改革不会一蹴而就. (simplified)人民幣匯率改革不會一蹴而就. (traditional)The RMB exchange rate reforms will not happen all at once."},{"chengyu":"一针见血","pinyin":"yī zhēn jiàn xiě","english_explanation":"hit the nail on the head"},{"chengyu":"一阵青一阵白","pinyin":"yīzhèn qīng yīzhèn bái","english_explanation":"describes the change someone's facial expression when they become surprised or angry"},{"chengyu":"一面之交","pinyin":"yī miàn zhī jiāo","english_explanation":"(literary) a casual relationship; acquaintance"},{"chengyu":"一鸣惊人","pinyin":"yī míng jīng rén","english_explanation":"to amaze the world with a single brilliant feat; to become famous overnight; to set the world on fire; No one was expecting much and then with one act, everybody was amazed; a bolt from the blue2006: anon, ESWC ——“梦，开始的地方 (Electronic Sports World Cup -- \"A dream is the starting place\")可比赛的过程却是让人大跌眼镜，与之前舆论的低调相比，两只队伍的表现可谓不鸣则已一鸣惊人。But as the game progressed, everybody had to take off their glasses in disbelief. Compared to the previous low expections in public opinion polls, the performance of the two teams was literally a bolt from the blue."},{"chengyu":"万古长青","pinyin":"wàngǔ chángqīng","english_explanation":"(Intermediate Mandarin) everlasting; remain fresh forever"},{"chengyu":"万家灯火","pinyin":"wàn jiā dēnghuǒ","english_explanation":"a myriad twinkling lights (of a city)"},{"chengyu":"万死不辞","pinyin":"wàn sǐ bù cí","english_explanation":"to not shirk one's commitment even if one dies ten thousand deaths"},{"chengyu":"万水千山","pinyin":"wànshuǐqiānshān","english_explanation":"(Advanced Mandarin) the trials of a long journey"},{"chengyu":"万象更新","pinyin":"wànxiàng gēngxīn","english_explanation":"everything has been completely renovated"},{"chengyu":"三下五除二","pinyin":"sān xià wǔ chú èr","english_explanation":"Start with three beads on the bottom (each lower bead is equal to 1)."},{"chengyu":"三五成群","pinyin":"sān wǔ chéngqún","english_explanation":"in groups of three or five"},{"chengyu":"三令五申","pinyin":"sānlìngwǔshēn","english_explanation":"to repeatedly admonish"},{"chengyu":"三友","pinyin":"sānyǒu","english_explanation":"(idiomatic) pine, bamboo and ume (plum blossom)"},{"chengyu":"三天打鱼两天晒网","pinyin":"sān tiān dǎ yú liǎng tiān shài wǎng","english_explanation":"to fail to perservere in something; to be unwilling or too lazy to concentrate"},{"chengyu":"三字经","pinyin":"sānzìjīng","english_explanation":"Three Character Classic"},{"chengyu":"三寸不烂之舌","pinyin":"sān cùn bù làn zhī shé","english_explanation":"to have a silver tongue; to have a way with words; to have an ability to schmooze"},{"chengyu":"三心二意","pinyin":"sānxīn'èryì","english_explanation":"without consistency or constancy, unable to concentrate on completing one goal at a time, likely to change minds easily"},{"chengyu":"三思而行","pinyin":"sān sī ér xíng","english_explanation":"think thrice before you act; look before you leap"},{"chengyu":"三振出局","pinyin":"sānzhèn chūjú","english_explanation":"(baseball) to strike out"},{"chengyu":"三更灯火五更鸡","pinyin":"sāngēng dēnghuǒ wǔgēng jī","english_explanation":"to burn the midnight oil, only to get up at the crack of dawn"},{"chengyu":"三月不知肉味","pinyin":"sān yuè bùzhī ròu wèi","english_explanation":"Describes a situation in which one is totally captivated by whatever activity is taking place; totally enraptured2005: 秋水 (Qiushui), 二00四文化年鉴评书：生活的美丽与哀愁 (Culture year 2004 literary criticism: the beauty and sadness of life)有人认为北岛在这本书中没有表现出思想之美，但那是评论家的事，对于我等普通读者来说，这样的文字，已经足以三月不知肉味了。. (simplified) 有人認為北島在這本書中沒有表現出思想之美，但那是評論家的事，對於我等普通讀者來說，這樣的文字，已經足以三月不知肉味了。. (traditional)There are some who believe that Bei Dao has not demonstrated a clarity of thought in this book; I will leave that to the reviewers and critics. However, for ordinary readers like me, this kind of writing was sufficient to keep me totally enraptured."},{"chengyu":"三番五次","pinyin":"sānfānwǔcì","english_explanation":"(Advanced Mandarin) again and again; time and again"},{"chengyu":"上知天文，下知地理","pinyin":"shàng zhī tiānwén, xià zhī dìlǐ","english_explanation":"describes someone who is very learned; a polymath"},{"chengyu":"上穷碧落下黄泉","pinyin":"shàng qióng bìluò xià huángquán","english_explanation":"search high and low2003: 李学江 (Li Xuejiang), 人民时评：也说萨达姆被捉 (People's critique: they also say that Saddam has been captured)那个在美军攻占巴格达之时悄然蒸发，让十数万大军在长达8个月时间里\"上穷碧落下黄泉，两处茫茫皆不见的\"的萨达姆，却一直像幽灵一般困扰着占领当局.Saddam had disappeared into thin air shortly after the American forces took Baghdad. For eight months, he caused hundreds of thousands of soldiers to search high and low, but was no where to be found. Despite this, he continued to haunt the occupation authorities like a phantom."},{"chengyu":"下笔如有神","pinyin":"xiàbǐ rú yǒu shén","english_explanation":"to write as if by divine inspiration读书破万卷，下笔如有神.well read, and an accomplished writer"},{"chengyu":"下笔如神","pinyin":"xiàbǐ rú shén","english_explanation":"to write as if by divine inspiration"},{"chengyu":"不上不下","pinyin":"bù shàng bù xià","english_explanation":"between a rock and a hard place"},{"chengyu":"不为五斗米折腰","pinyin":"bù wèi wǔ dǒu mǐ zhé yāo","english_explanation":"to not compromise one's integrity just to earn a small salary in a deadend job; to not sacrifice one's ideals in order to make a living2005: anon., 周鸿袆：大丈夫光明磊落 我不是个谦谦君子 (An interview with former Yahoo China executive, Zhou Hongwei: It takes a brave man to be open and frank, modesty has never been my strong suit)我对很多年轻人和创业人有一个建议，如果一个人年纪大了，不得不为五斗米折腰的时候没办法。但是对于年轻人，对于想创业的新一代的人，还是要有理想主义色彩，不要被物化的东西迷惑住。整天比哪个公司给我的工资更高，或者哪个公司的名气听起来更能满足虚荣心。I have a suggestion for the many young people and entrepreneurs out there: if a person is older, there may come a time when he can ill-afford to not sacrifice his ideals in order to make a living. But for the young person, or the next-generation of aspiring entrepreneur, it is better to have an idealist's mindset. Don't be enticed by material things. Don't sit there all day comparing which company will pay you a higher salary, or which company's reputation sounds better capable of satisfying your sense of vanity."},{"chengyu":"不了了之","pinyin":"bùliǎoliǎozhī","english_explanation":"to leave something unresolved他本來請我旅遊，但後來就不了了之了。 (trad.)他本来请我旅游，但后来就不了了之了。 (simp.)tā běnlái qǐng wǒ lǚyóu, dàn hòulái jiù bùliǎoliǎozhī leHe had invited me to go travelling with him, but the idea came to nothing."},{"chengyu":"不二法门","pinyin":"bù èr fǎmén","english_explanation":"the one and only way"},{"chengyu":"不以为意","pinyin":"bù yǐ wéi yì","english_explanation":"to be oblivious to (or of); not to take it seriously"},{"chengyu":"不共戴天","pinyin":"bù gòng dài tiān","english_explanation":"swear not to live under the same sky (with one's enemy)"},{"chengyu":"不分胜负","pinyin":"bùfēn shèngfù","english_explanation":"unable to distinguish the winner from the loser; to be tied"},{"chengyu":"不到黄河心不死","pinyin":"bù dào Huánghé xīn bù sǐ","english_explanation":"Until all is over, ambition never dies; not stop until one reaches one's goal; not to give up hope until one comes to one's tether's end; not to stop until one reaches the Yellow river; refuses to give up until all hope is gone.2005: editorial staff of People's Education Press, 纪念抗日战争胜利60周年 (Commemorating the 60th anniversary of the victory in the sino-Japanese war)从历史的源头开始，中国人民在困惑之中选择了抗争之路，义无返顾的走下去，形成了一种“不到黄河心不死”、“不到长城非好汉”的积极向上、不懈追求的精神From the beginning of history, the Chinese people have chosen to fight back when in dire circumstances. They persist as if duty-bound not to turn back. It is a tireless seeking spirit that forms a kind of positive resolve where one says, \"I will not give up hope until I reach the Yellow River,\" or \"I have not truly lived until I have reached the Great Wall."},{"chengyu":"不动声色","pinyin":"bù dòng shēngsè","english_explanation":"not showing any feeling or emotion; with composure; keep one's cool2005: 黄智义 (Huang Zhiyi), 一名男子偷窥女厕所 机智女子不动声色报警擒色狼 (news headline)一名男子偷窥女厕所机智女子不动声色报警擒色狼Man caught peeping into female bathroom; quick-thinking woman kept her cool and reported it to the police; sexual predator arrested"},{"chengyu":"不卑不亢","pinyin":"bùbēibùkàng","english_explanation":"(Advanced Mandarin) neither obsequious nor supercilious"},{"chengyu":"不可开交","pinyin":"bùkě kāijiāo","english_explanation":"unable to break away from one's duties or tasks; can't catch a break"},{"chengyu":"不可思议","pinyin":"bùkěsīyì","english_explanation":"10^64"},{"chengyu":"不可无一，不可有二","pinyin":"bùkě wú yī, bùkě yǒu èr","english_explanation":"(this person) is irreplaceable, no one can replace him"},{"chengyu":"不可胜数","pinyin":"bùkěshēngshǔ","english_explanation":"too numerous to count"},{"chengyu":"不可胜言","pinyin":"bùkěshèngyán","english_explanation":"cannot be expressed in words; there are no words to describe it"},{"chengyu":"不可胜计","pinyin":"bùkě shèng jì","english_explanation":"cannot count them all"},{"chengyu":"不可言喻","pinyin":"bùkě yán yù","english_explanation":"cannot put into words"},{"chengyu":"不可限量","pinyin":"bùkě xiànliàng","english_explanation":"limitless (opportunities); very promising2005: anon, 上海的未来不可限量 有钱就买上海的房子 (news headline)上海的未来不可限量，有钱就买上海的房子 (simp.)上海的未來不可限量，有錢就買上海的房子 (trad.)Shanghai has a very promising future; if you have money, you should buy a house in Shanghai."},{"chengyu":"不在话下","pinyin":"bù zài huà xià","english_explanation":"to be a cinch; to not be a problem"},{"chengyu":"不堪一击","pinyin":"bùkān yījī","english_explanation":"cannot withstand a single blow; collapse at the first blow"},{"chengyu":"不堪回首","pinyin":"bùkān huíshŏu","english_explanation":"cannot bear to look back on. find it unbearable to recall"},{"chengyu":"不如意事，十常八九","pinyin":"bùrú yì shì, shí cháng bā jiǔ","english_explanation":"things are constanting going wrong2004: anon, 曾仕强教授的回答 (Professor Zeng's response)人终究不是神，不过是有限的人，必须顺应人性，善用大自然的潜力，站在“不如意事，十常八九”的局限中，以神妙莫测的方式来使其吉多凶少 (simp.) 人終究不是神，不過是有限的人，必須順應人性，善用大自然的潛力，站在“不如意事，十常八九”的局限中，以神妙莫測的模式來使其吉多凶少 (trad.)People are not gods; they are humans with human limitations, and so must accommodate human nature. One must find a good way to utilize Mother Nature's potential. Within the boundaries of a life where things are constantly going wrong,\" one must find a way to think outside of the box so that one can have more hits than misses."},{"chengyu":"不形于色","pinyin":"bùxíng yú sè","english_explanation":"one's facial expression does not reveal any emotion; to not reveal any emotion on one's face"},{"chengyu":"不得其门而入","pinyin":"bù dé qí mén ér rù","english_explanation":"to not have an \"in\"; unable to crack into (a market); to try to find an in without any success; to be unable to gain entrance2005: Design News China editorial staff, 争议英特尔称AMD旧技术援华 (Dispute ... Intel claims that old AMD technology is helping China)在经历了多年的不得其门而入后，中国终于在2005年10月24日正式成为“X86体系俱乐部”的正式成员。On 24 October 2005, after having spent many years of trying to find an \"in\" without any success, China finally became a formal member of the \"X86 architecture club.\"undated: China National Cotton editorial staff 中国企业信息化道路 (Information Super Highway for Chinese Industries)因此，若你所安装或开放的功能、网络服务与通讯连接埠越少，骇客就越不得其门而入。Because of this, the fewer capabilities/network services and communications connection ports that you install or open, the more that hackers will be unable to gain entrance (to your system)."},{"chengyu":"不忍人之心","pinyin":"bù rěn rén zhī xīn","english_explanation":"a mind which cannot bear to see the sufferings of others"},{"chengyu":"不愁衣食","pinyin":"bù chóu yī shí","english_explanation":"very wealthy"},{"chengyu":"不成体统","pinyin":"bù chéng tǐtǒng","english_explanation":"most improper"},{"chengyu":"不拘小节","pinyin":"bù jū xiǎo jié","english_explanation":"to not worry about minor matters; to not worry about the details; to not be a stickler for details; not worry about dotting all the i's and crossing all the t's"},{"chengyu":"不按牌理出牌","pinyin":"bù àn pái lǐ chū pái","english_explanation":"think outside the box; do things in an unconventional way"},{"chengyu":"不明所以","pinyin":"bùmíng suǒyǐ","english_explanation":"to not understand the reason why"},{"chengyu":"不欢而散","pinyin":"bù huān ér sàn","english_explanation":"part [break up; end; disperse] in discord [with ill feelings; anger]; break up in disagreement; depart unhappily; end on a sour note; part in dudgeon; part on bad terms."},{"chengyu":"不正之风","pinyin":"bù zhèng zhī fēng","english_explanation":"(Advanced Mandarin) unhealthy tendency"},{"chengyu":"不死也半条命","pinyin":"bù sǐ yě bàn tiáo mìng","english_explanation":"describes a person in a dangerous predicament"},{"chengyu":"不求有功，但求无过","pinyin":"bù qiú yǒu gōng, dàn qiú wú guò","english_explanation":"(somebody who) does not try to accomplish anything, but rather avoids doing things that would end up in his making a mistake and getting yelled at by others; color inside the lines; a complacent attitude2005: 张志军 ed. (Zhang Zhijun), 小公司如何长大：创立品牌的艺术 (How small companies grow large: the art of creating a brand)小公司从前那种不求有功但求无过的发展思路，已经无法适应市场竞争的需要。That kind of color inside the lines mentality of development, previously seen in small companies, can no longer accommodate the requirements of market competition."},{"chengyu":"不白之冤","pinyin":"bù bái zhī yuān","english_explanation":"a miscarriage of justice which remains uncorrected"},{"chengyu":"不管三七二十一","pinyin":"bùguǎn sān qī èr shí yī","english_explanation":"(colloquial) to cast all caution to the wind and act without thinking of the consequences"},{"chengyu":"不耻下问","pinyin":"bù chǐ xià wèn","english_explanation":"not ashamed to learn from one's subordinates"},{"chengyu":"不见不散","pinyin":"bùjiànbùsàn","english_explanation":"to stay put until other people have arrived"},{"chengyu":"不言不语","pinyin":"bùyánbùyǔ","english_explanation":"to not say a word; to keep silent"},{"chengyu":"不言而喻","pinyin":"bù yán ér yù","english_explanation":"(Advanced Mandarin) it goes without saying; it is self-evident"},{"chengyu":"不计其数","pinyin":"bùjìqíshù","english_explanation":"countless"},{"chengyu":"不识庐山真面目","pinyin":"bù shì lúshān zhēn miànmù","english_explanation":"to not recognize someone when you see them (despite the fact that you should know who the person is)"},{"chengyu":"不负众望","pinyin":"bù fù zhòngwàng","english_explanation":"to not let everyone down; to not let anybody down"},{"chengyu":"不足为外人道","pinyin":"bùzú wèi wàirén dào","english_explanation":"not fit to be told to others; no need to tell others"},{"chengyu":"不足为虑","pinyin":"bùzú wéi lǜ","english_explanation":"not worth worrying about"},{"chengyu":"不问青红皂白","pinyin":"bù wèn qīnghóngzàobái","english_explanation":"without forethought"},{"chengyu":"不食人间烟火","pinyin":"bù shí rénjiān yānhuǒ","english_explanation":"out of touch; no sense of the practical这一群不食人间烟火的人，根本不知道别人的实际痛苦！These people, who are out of touch with reality, just don't understand the real suffering of others!"},{"chengyu":"不鸣则已，一鸣惊人","pinyin":"bù míng zé yǐ, yīmíngjīngrén","english_explanation":"to amaze the world with a single brilliant feat; to become famous overnight; to set the world on fire; No one was expecting much and then with one act, everybody was amazed; a bolt from the blue2006: anon, ESWC ——“梦，开始的地方 (Electronic Sports World Cup -- \"A dream is the starting place\")可比赛的过程却是让人大跌眼镜，与之前舆论的低调相比，两只队伍的表现可谓不鸣则已一鸣惊人。But as the game progressed, everybody had to take off their glasses in disbelief. Compared to the previous low expections in public opinion polls, the performance of the two teams was literally a bolt from the blue."},{"chengyu":"东一句西一句","pinyin":"dōng yī jù xī yī jù","english_explanation":"speak without any sense of coherence"},{"chengyu":"东奔西窜","pinyin":"dōngbēnxīcuàn","english_explanation":"Alternative form of 东逃西窜."},{"chengyu":"东家长西家短","pinyin":"dōng jiā cháng xī jiā duǎn","english_explanation":"gossip about others"},{"chengyu":"东施效颦","pinyin":"dōngshīxiàopín","english_explanation":"indiscriminate imitation often gives rise to bad results"},{"chengyu":"东逃西窜","pinyin":"dōngtáoxīcuàn","english_explanation":"to scurry from place to place, especially when being chased (such as a rat)"},{"chengyu":"两下","pinyin":"liǎngxià","english_explanation":"skill; talent"},{"chengyu":"两下子","pinyin":"liǎngxiàzi","english_explanation":"(to know) a thing or two; (to have) a few tricks up one's sleeve"},{"chengyu":"两害相权取其轻","pinyin":"liǎng hài xiāng quán qǔ qí qīng","english_explanation":"to choose the lesser of two evils"},{"chengyu":"丧家之狗","pinyin":"sàng jiā zhī gǒu","english_explanation":"a desparate person who has nobody to turn to"},{"chengyu":"临难苟免","pinyin":"línnàn gǒumiǎn","english_explanation":"to live in defeat and humiliation when faced with disaster"},{"chengyu":"为人处世","pinyin":"wéi rén chǔ shì","english_explanation":"how one gets along in the world; one's attitude about and way of doing things"},{"chengyu":"举动荆棘","pinyin":"jǔdòng jīngjí","english_explanation":"every move one makes seems as difficult as walking through brambles"},{"chengyu":"举手投足","pinyin":"jǔshǒu tóu zú","english_explanation":"the way one moves; the way in which one carries oneself; how one carries oneself"},{"chengyu":"义同生死","pinyin":"yìtóngshēngsǐ","english_explanation":"to be bound by oath to live and die together"},{"chengyu":"乌云密布","pinyin":"wūyún mìbù","english_explanation":"a heavy downpour is in the making"},{"chengyu":"乘虚而入","pinyin":"chéngxūérrù","english_explanation":"to catch someone off guard"},{"chengyu":"乘风破浪","pinyin":"chéng fēng pò làng","english_explanation":"to fearlessly and steadfastly pursue a goal without regard to setbacks"},{"chengyu":"也有今天","pinyin":"yě yǒu jīntiān","english_explanation":"(colloquial) to get one's comeuppance for a wrong deed約翰的女友發現了他的不忠並甩了他，原來他也有今天。 (trad.)约翰的女友发现了他的不忠并甩了他，原来他也有今天。 (simp.)After discovering John's infidelity his girlfriend dumped him - in the end he really got his just deserts.你也有今天都是你自作自受。You'll get what you deserve for what you've done."},{"chengyu":"乱点鸳鸯谱","pinyin":"luàn diǎn yuānyāngpǔ","english_explanation":"an arbitrary pairing of two people or two things; an odd pairing2006: 乐天 (Le Tian), 乱点鸳鸯谱 诺基亚6610塞进罗技G5里 (An odd pair ... Nokia 6610 inserted into Logitech G5)国外的硬件发烧友独特的创意和高超的动手能力，一向为国内玩家所称道。不过有些改造看起来确实有些不伦不类，比方说下面这个被作者美其名曰“LogiNoki”的鼠标MOD作品，就给人一种乱点鸳鸯谱的感觉，作者让诺基亚6610手机和罗技G5鼠标凑成了一对，将6610的屏幕和控制芯片拆下塞进G5的“肚子”里，组合成一个带LCD屏幕的鼠标。The unique creativity and superb abilities of foreign hardware fanatics has always received high praise from domestic gamers. However, some innovations truly defy description. For example, one can't help but getting the sense that the mod design of the computer mouse below, euphemistically called \"LogiNoki\" by its creator, is an odd pairing. Its creator paired the Nokia 6610 cellphone with the Logitech G5 computer mouse by taking the screen and the control chip from the 6610, and inserting it into the \"guts\" of the G5. This combination produces a computer mouse with an LCD screen."},{"chengyu":"事不宜迟","pinyin":"shìbùyíchí","english_explanation":"now is the time; the matter cannot be put off; it must be done right away"},{"chengyu":"事倍功半","pinyin":"shì bèi gōng bàn","english_explanation":"to get half the result with twice the effort"},{"chengyu":"事半功倍","pinyin":"shì bàn gōng bèi","english_explanation":"to yield twice the result with half the effort"},{"chengyu":"云屯","pinyin":"yúntún","english_explanation":"(literary) (people) gathered together in great numbers"},{"chengyu":"云屯雨集","pinyin":"yúntún yǔjí","english_explanation":"(people) gathered together in great numbers"},{"chengyu":"五陵年少","pinyin":"wǔlíng niánshào","english_explanation":"fashionable young men1965: Pai Hsien-yung, Taipei People, The Eternal Snow Beauty尹雪艷總也不老。十幾年前那一班在上海百樂門舞廳替他捧場的五陵年少，有些頭上開了頂，有些鬢添了霜 (trad.) 尹雪艳总也不老。十几年前那一班在上海百乐门舞厅替他捧场的五陵年少，有些头上开了顶，有些鬓添了霜 (simp.)Yin Hsueh-yen somehow never seemed to age. Of those fashionable young men who had been her admirers more than a dozen years ago in Shanghai's Paramount Ballroom, some had grown bald on top and some were graying at the temples (Taipei People bilingual edition, ISBN 9622018599)"},{"chengyu":"井底之蛙","pinyin":"jǐng dǐ zhī wā","english_explanation":"a person of very limited outlook and experiencec. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms, Chapter 113 (三國演義/第113回)汝乃井底之蛙，安知玄奧乎！You're (like) a frog at the bottom of a well (who can only see part of the sky), how would you know about anything that is profound!1784: Cao Xueqin, Dream of the Red Chamber, Chapter 49 (紅樓夢/第049回)可知我井底之蛙，成日家只說現在的這幾個人是有一無二的。 (trad.)可知我井底之蛙，成日家只说现在的这几个人是有一无二的。 (simp.)You can tell that I am a frog at the bottom of a well. All day long, we just talk about how these few people are so unique."},{"chengyu":"交头接耳","pinyin":"jiāotóujiē'ěr","english_explanation":"to speak in each other's ears; to whisper to each other"},{"chengyu":"交臂失之","pinyin":"jiāo bì shī zhī","english_explanation":"to narrowly miss a golden opportunity (to meet someone etc.)"},{"chengyu":"亲冒矢石","pinyin":"qīn mào shǐshí","english_explanation":"to personally brave the slings and arrows; to put oneself in the line of fire"},{"chengyu":"人不像人，鬼不像鬼","pinyin":"rén bù xiàng rén, guǐ bù xiàng guǐ","english_explanation":"pure misery我过了四年人不像人鬼不像鬼的生活. (simp.) 我過了四年人不像人鬼不像鬼的生活. (trad.)For four years, I lived a life of pure misery."},{"chengyu":"人不知，鬼不觉","pinyin":"rén bù zhī, guǐ bù jué","english_explanation":"something that is so mysterious, that it cannot be known by humans or felt by ghosts"},{"chengyu":"人困马乏","pinyin":"rénkùn-mǎfá","english_explanation":"the force of men and horses are tired and exhausted"},{"chengyu":"人地生疏","pinyin":"rén dì shēngshū","english_explanation":"to be unfamiliar with the place and the people; to be a complete stranger"},{"chengyu":"人声鼎沸","pinyin":"rén shēng dǐng fèi","english_explanation":"a cacophony of voices"},{"chengyu":"人心隔肚皮","pinyin":"rénxīn gé dùpí","english_explanation":"keep one's thoughts to oneself"},{"chengyu":"人殊意异","pinyin":"rén shū yì yì","english_explanation":"people and opinions will vary; not everyone will view it the same way"},{"chengyu":"人神共愤","pinyin":"rénshén gòng fèn","english_explanation":"hated and reviled"},{"chengyu":"人间天上","pinyin":"rénjiān tiān shàng","english_explanation":"describes two people who are separated by a great distance"},{"chengyu":"人面桃花","pinyin":"rén miàn táohuā","english_explanation":"describes a man's nostalgic memory of an old sweetheart"},{"chengyu":"人高马大","pinyin":"rén gāo mǎ dà","english_explanation":"(of a person) unusually tall"},{"chengyu":"仁人君子","pinyin":"rénrén jūnzi","english_explanation":"benevolent gentleman; public-spirited person; philanthropist"},{"chengyu":"今朝有酒今朝醉","pinyin":"jīnzhāo yǒu jiǔ jīnzhāo zuì","english_explanation":"describes someone with attitude of instant gratification; describes someone who never thinks about the future; here today, gone tomorrow; live for the now2005: anon, 要豪宅不要孩子 白领高质量追求今朝有酒今朝醉 (They want nice homes but don't want kids, white collar workers live for the now)今天的年轻人也应该为他们的后人艰苦奋斗，不能抱着“今朝有酒今朝醉”的态度过日子。 (simp.) 今天的年輕人也應該為他們的後人艱苦奮鬥，不能抱著“今朝有酒今朝醉”的態度過日子。 (trad.)Today's youth must struggle diligently for the sake of those who will come after them. They must not while away their time with an attitude of here today, gone tomorrow."},{"chengyu":"今生今世","pinyin":"jīnshēngjīnshì","english_explanation":"in this lifetime; for the rest of one's life"},{"chengyu":"从天而降","pinyin":"cóng tiān ér jiàng","english_explanation":"to happen all of the sudden; to happen out of the blue; to come out of nowhere"},{"chengyu":"付之一炬","pinyin":"fù zhī yī jù","english_explanation":"to commit to the flames"},{"chengyu":"以儆效尤","pinyin":"yǐ jǐng xiàoyóu","english_explanation":"to make a public demonstration of punishing a wrongdoer in order to deter innocents who might mimic the example of the wrongdoer."},{"chengyu":"以牙还牙","pinyin":"yǐ yá huán yá","english_explanation":"to take an eye for an eye"},{"chengyu":"以讹传讹","pinyin":"yǐ é chuán é","english_explanation":"to incorrectly relay an erroneous message (so that it becomes increasingly distorted)"},{"chengyu":"众所周知","pinyin":"zhòngsuǒzhōuzhī","english_explanation":"as everyone knows"},{"chengyu":"伸手不见五指","pinyin":"shēnshǒu bù jiàn wǔ zhǐ","english_explanation":"describes when it is dark; pitch black; can't see your hand in front of you"},{"chengyu":"低声下气","pinyin":"dīshēng xiàqì","english_explanation":"to be meek and timid; to be submissive"},{"chengyu":"何足挂齿","pinyin":"hézú guàchǐ","english_explanation":"what's the point of even mentioning; why bother even mentioning; not worth even mentioning"},{"chengyu":"作如是观","pinyin":"zuò rú shì guān","english_explanation":"to view the matter in this way"},{"chengyu":"佯输诈败","pinyin":"yáng shū zhà bài","english_explanation":"to feign defeat"},{"chengyu":"使出浑身解数","pinyin":"shǐchū húnshēn jiěshù","english_explanation":"to use all one's skill; to do everything within one's power; to try in every way one knows how; to give it one's all"},{"chengyu":"供不应求","pinyin":"gōng bú yìng qiú","english_explanation":"be in short supply (Literally: supply doesn't meet demand)"},{"chengyu":"依山傍水","pinyin":"yīshān-bàngshuǐ","english_explanation":"next to the mountains yet close to a body of water (usually referring to a scenic place)"},{"chengyu":"信口雌黄","pinyin":"xìnkǒucíhuáng","english_explanation":"to make irresponsible remarks, to utter nonsense"},{"chengyu":"俯仰无愧","pinyin":"fǔyǎng wúkuì","english_explanation":"to have done nothing to make one feel ashamed"},{"chengyu":"倒悬之危","pinyin":"dàoxuán zhī wēi","english_explanation":"a danger which puts one in dire straits"},{"chengyu":"倒抽一口气","pinyin":"dào chōu yī kǒu qì","english_explanation":"to gasp"},{"chengyu":"倒持干戈","pinyin":"dào chí gān'gē","english_explanation":"to give up one's advantage or power to someone else"},{"chengyu":"倒竖虎须","pinyin":"dàoshùhǔxū","english_explanation":"describes a fierce or angry look in which one's whiskers seem to stand straight up"},{"chengyu":"倚强欺弱","pinyin":"yǐqiáng qī ruò","english_explanation":"to rely on one's might to bully the weak"},{"chengyu":"债台高筑","pinyin":"zhài tái gāo zhú","english_explanation":"be up to one's eyeballs in debt; racked with debt"},{"chengyu":"偷得浮生半日闲","pinyin":"tōu dé fúshēng bànrì xián","english_explanation":"take some time out from a hectic work schedule"},{"chengyu":"偷目窃望","pinyin":"tōu mù qiè wàng","english_explanation":"to steal a glance"},{"chengyu":"偷鸡摸狗","pinyin":"tōu jī mō gǒu","english_explanation":"to engage in petty thievery"},{"chengyu":"傍若无人","pinyin":"bàng ruò wú rén","english_explanation":"Alternative form of 旁若无人."},{"chengyu":"傲慢无礼","pinyin":"àomànwúlǐ","english_explanation":"arrogant, displaying little respect for others"},{"chengyu":"兄友弟恭","pinyin":"xiōng yǒu dì gōng","english_explanation":"to show love and respect as good brothers should"},{"chengyu":"先天下之忧而忧后天下之乐而乐","pinyin":"xiān tiānxià zhī yōu ér yōu, hòu tiānxià zhī lè ér lè","english_explanation":"describes a good leader; the first to bear hardships, and the last to enjoy comforts"},{"chengyu":"先礼后兵","pinyin":"xiān lǐ hòu bīng","english_explanation":"when dealing with another, to begin by approaching the situation politely - then, when results are not forthcoming, to resort to aggression"},{"chengyu":"光天化日","pinyin":"guāng tiān huà rì","english_explanation":"in broad daylight"},{"chengyu":"光彩夺目","pinyin":"guāngcǎi duómù","english_explanation":"eye-catching"},{"chengyu":"光明正大","pinyin":"guāngmíng zhèngdà","english_explanation":"high-principled; open and aboveboard; just and honorable; frank and righteous; without artifice2006: 巫继学 (Wu Jixue), 光明正大的改革何拒公众参与大辩论? (When conducting open and aboveboard reforms, why deny the public a chance to participate in the debate?)改革是公共大众的事，改革是光明正大的事，不能只在少数精英贵族中讨论，不能静悄悄地进行，更不能在那里搞什么暗箱操作。 (simp.)改革是公共大眾的事，改革是光明正大的事，不能只在少數精英貴族中討論，不能靜悄悄地進行，更不能在那裡搞什麼暗箱操作。 (trad.)Reform is a public affair for the masses. Reform is an open and aboveboard affair. It should not merely be discussed among a small number of the best and brightest of the aristocracy. It should not be carried out in a \"hush-hush\" manner, much less behind closed doors."},{"chengyu":"光明磊落","pinyin":"guāngmíng lěiluò","english_explanation":"straightforward and upright"},{"chengyu":"克己奉公","pinyin":"kèjǐ fènggōng","english_explanation":"be wholeheartedly devoted to public duty, work selflessly for the public interest"},{"chengyu":"兜肚连肠","pinyin":"dōu dù lián cháng","english_explanation":"the whole thing; the whole kit and caboodle"},{"chengyu":"兢兢业业","pinyin":"jīngjīngyèyè","english_explanation":"(Advanced Mandarin) cautious and conscientious"},{"chengyu":"全心全意","pinyin":"quánxīnquányì","english_explanation":"wholeheartedly, without reservation"},{"chengyu":"八九不离十","pinyin":"bā jiǔ bù lí shí","english_explanation":"(colloquial) almost目前已有人猜得“八九不离十”了！！At present, there are already people who have almost guessed it!!"},{"chengyu":"八仙过海，各显神通","pinyin":"bāxiān guò hǎi, gè xiǎn shéntōng","english_explanation":"everybody using their talents to achieve a common goal"},{"chengyu":"八千里路云和月","pinyin":"bā qiān lǐ lù yún hé yuè","english_explanation":"Describes the great distances involved in a military campaign."},{"chengyu":"八拜之交","pinyin":"bābàizhījiāo","english_explanation":"describing the intimacy of relations between platonic friends"},{"chengyu":"八竿子打不着","pinyin":"bā gānzi dǎ bù zháo","english_explanation":"(colloquial) barely related; far off2009: Cai Huangshang (彩皇上), 中500万就“消失”说明了啥当500万元大奖砸中上虞人阮某时，欣喜若狂的他选择了高调庆祝，大摆宴席，大派红包。然而，他付出的代价是，一夜间他家门庭若市，不仅很多八竿子打不着的亲戚纷至沓来，就连很多素不相识的陌生人也开始上门找他借钱。Official Ruan Moushi was wild with joy when he hit the five million dollar jackpot. He chose to have a lofty celebration, including a massive banquet and huge amounts of hongbao. But he really paid the price when, one night, his house started to become a hive of activity. Not only did a ton of random relatives start pouring into the place, but also complete strangers, all wanting to borrow some of this money."},{"chengyu":"共襄盛举","pinyin":"gòngxiāngshèngjǔ","english_explanation":"to work together to complete a major project"},{"chengyu":"关公面前耍大刀","pinyin":"Guāngōng miànqián shuǎ dàdāo","english_explanation":"to show off in front of an expert"},{"chengyu":"兵临城下","pinyin":"bīng lín chéng xià","english_explanation":"the enemy army is just outside of the walls of the city"},{"chengyu":"兵强将盛","pinyin":"bīng qiáng jiàng shèng","english_explanation":"to command an impressive military force"},{"chengyu":"兵微将寡","pinyin":"bīng wēi jiàng guǎ","english_explanation":"to have a small number of troops and generals"},{"chengyu":"兵精将勇","pinyin":"bīng jīng jiàng yǒng","english_explanation":"to command an impressive military force"},{"chengyu":"兵荒马乱","pinyin":"bīng huāng mǎ luàn","english_explanation":"war-torn; ravaged by war"},{"chengyu":"兵败如山倒","pinyin":"bīng bài rú shān dǎo","english_explanation":"to be soundly defeated2006: 报喜鸟 (Bao Xiniao), 半决赛江苏兵败如山倒 广东取开门红 (News headline)半决赛江苏兵败如山倒 广东取开门红Jiangsu soundly defeated during semi-finals Guangdong off to a good start"},{"chengyu":"养尊处优","pinyin":"yǎngzūnchǔyōu","english_explanation":"to live one's whole life in opulence and enjoying high social status"},{"chengyu":"冒烟突火","pinyin":"mào yān túhuǒ","english_explanation":"battle one's way through smoke and flames"},{"chengyu":"冢中枯骨","pinyin":"zhǒng zhōng kū gǔ","english_explanation":"a deadbeat; a useless person; a person without any power or influencec. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 11孔融曰：「袁公路冢中枯骨，何足挂齿！」Kong Rong said, \"Yuan Gonglu is a deadbeat; he's not even worth mentioning!\""},{"chengyu":"冬暖夏凉","pinyin":"dōng nuǎn xià liáng","english_explanation":"warm in the winter and cool in the summer"},{"chengyu":"冰消瓦解","pinyin":"bīngxiāo wǎjiě","english_explanation":"to melt like ice and break like tiles; to disintegrate; to dissolve"},{"chengyu":"冰肌玉骨","pinyin":"bīng jī yù gǔ","english_explanation":"(of a woman) a fair-skinned beauty"},{"chengyu":"决一死战","pinyin":"juéyīsǐzhàn","english_explanation":"to wage a life-and-death battle"},{"chengyu":"冷嘲热讽","pinyin":"lěngcháorèfèng","english_explanation":"burning satire and freezing irony; sarcastic ridicule"},{"chengyu":"冷眼旁观","pinyin":"lěngyǎn pángguān","english_explanation":"to look on coldly without getting involved"},{"chengyu":"出其不意","pinyin":"chū qí bù yì","english_explanation":"to take somebody by surprise; to catch somebody unawares"},{"chengyu":"出口成章","pinyin":"chū kǒu chéng zhāng","english_explanation":"words flow from the mouth as from the pen of a master"},{"chengyu":"出淤泥而不染","pinyin":"chū yūní ér bù rǎn","english_explanation":"to rise out of the ghetto and make something of oneself; to have been in bad surroundings without allowing oneself to be affected by them."},{"chengyu":"出生入死","pinyin":"chū shēng rù sǐ","english_explanation":"(literary) risking one's life; without regard to one's own life"},{"chengyu":"出难题","pinyin":"chū nántí","english_explanation":"(Intermediate Mandarin) to make something difficult for"},{"chengyu":"刀子嘴豆腐心","pinyin":"dāozi zuǐ dòufu xīn","english_explanation":"(slang) describes someone who has a sharp tongue but a soft heart; someone with more bark than bite我們都知道你是個刀子嘴豆腐心。 (trad.)我们都知道你是个刀子嘴豆腐心。 (simp.)We all know that even though you talk tough, you're a softy underneath it all."},{"chengyu":"分忧共患","pinyin":"fēnyōu gòng huàn","english_explanation":"to share someone's concerns and worries"},{"chengyu":"分花拂柳","pinyin":"fēn huā fú liǔ","english_explanation":"to gracefully saunter over (like an elegant woman etc.)"},{"chengyu":"别具一格","pinyin":"bié jù yī gé","english_explanation":"have a style of one's own; having a unique [distinctive] style; in a class by itself; peculiar"},{"chengyu":"别开生面","pinyin":"bié kāi shēng miàn","english_explanation":"forge a new path; stand out from the rest"},{"chengyu":"刻舟求剑","pinyin":"kè zhōu qiú jiàn","english_explanation":"rigidly cling to an idea or approach without considering the reality of a situation; to stubbornly cling to traditionc. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms, Chapter 120 (三国演义/第120回)似你这样寻根究底，便是刻舟求剑，胶柱鼓瑟了It seems as though this kind of thorough investigation that you are conducting is like notching a moving boat in order to mark where your sword dropped into the river, you are being inflexible.c. 1900 - 1995: Xia Yan, Unite and advance through liberation thought (解放思想团结前进)文学艺术工作者必须正视我国当前迅速变化的实际，来考察我们过去用惯了的文艺理论，而不能刻舟求剑。Workers in the literary arts must squarely face the reality of the rapid changes currently taking place within our country when considering the wellworn theories of the past about literature and art, and must not stubbornly cling to tradition."},{"chengyu":"削足适履","pinyin":"xuē zú shì lǚ","english_explanation":"to force an impractical solution to a problem"},{"chengyu":"前赴后继","pinyin":"qiánfùhòujì","english_explanation":"(Advanced Mandarin) to advance wave upon wave"},{"chengyu":"前遮后拥","pinyin":"qián zhē hòu yǒng","english_explanation":"amidst a throng and clamor; noisy and crowded"},{"chengyu":"剑拔弩张","pinyin":"jiàn bá nǔ zhāng","english_explanation":"tense situation; ready to fight"},{"chengyu":"剩水残山","pinyin":"shèng shuǐ cán shān","english_explanation":"the ravaged countryside"},{"chengyu":"力所能及","pinyin":"lì suǒ néng jí","english_explanation":"(Elementary Mandarin) within one's power; within one's ability"},{"chengyu":"办事不牢","pinyin":"bànshì bù láo","english_explanation":"unreliable in the performance of one's work"},{"chengyu":"功亏一篑","pinyin":"gōng kuī yī kuì","english_explanation":"close but no cigar; close, but no cigar"},{"chengyu":"功微德薄","pinyin":"gōng wēi dé bó","english_explanation":"(a person of) few accomplishments or virtues"},{"chengyu":"助人为乐","pinyin":"zhù rén wéi lè","english_explanation":"to take pleasure in helping people"},{"chengyu":"助纣为虐","pinyin":"zhù zhòu wéi nüè","english_explanation":"to help the wicked perpetrate wicked deeds; to help a tyrant to do evil"},{"chengyu":"势不可当","pinyin":"shì bùkě dāng","english_explanation":"fierce and overwhelming; swift and unstoppable"},{"chengyu":"势均力敌","pinyin":"shìjūnlìdí","english_explanation":"to be evenly matched"},{"chengyu":"势如奔马","pinyin":"shì rú bēnmǎ","english_explanation":"to have an imposing manner; to have an intimidating presence"},{"chengyu":"势如破竹","pinyin":"shì rú pò zhú","english_explanation":"like splitting bamboo; like a hot knife cutting through butter; with irresistable force"},{"chengyu":"勇气百倍","pinyin":"yǒngqì bǎibèi","english_explanation":"extremely brave"},{"chengyu":"勇而无谋","pinyin":"yǒng ér wú móu","english_explanation":"brave but lacking an ability to think strategically; all brawn and no brains"},{"chengyu":"勤工俭学","pinyin":"qíngōngjiǎnxué","english_explanation":"(Advanced Mandarin) work-study program"},{"chengyu":"化腐朽为神奇","pinyin":"huà fǔxiǔ wéi shénqí","english_explanation":"to find a new use for something that has been discarded; make a silk purse out of a sow's ear2004: jason, 化腐朽为神奇！尽力拯救你的照片 (Make a silk purse out of a sow's ear! Pulling out all the stops to rescue your photographs)但如果你使用的是数码相机那情况就不同了，利用强大的PHOTOSHOP完全可以挽救你的废片，甚至乎还能化腐朽为神奇，将一张平淡的照片变成一张看头十足的精品之作呢！But if you are using a digital camera, then the situation is different. Using powerful software such as PHOTOSHOP, you can utterly rescue a picture that you had deemed a lost cause. You can even make a silk purse out of a sow's ear by turning a dull photograph into a fine work of art."},{"chengyu":"化险为夷","pinyin":"huà xiǎn wéi yí","english_explanation":"to head off a disaster"},{"chengyu":"匡君救主","pinyin":"kuāng jūn jiù zhǔ","english_explanation":"(archaic) to rescue the emperor; to rescue the king"},{"chengyu":"十万八千里","pinyin":"shí wàn bā qiān lǐ","english_explanation":"describes a great distance; far off偶从十万八千里的地方回来了(He/She) unexpectedly returned from a far off land"},{"chengyu":"千乘","pinyin":"qiānshèng","english_explanation":"(archaic) one thousand horse-drawn chariots"},{"chengyu":"千乘万骑","pinyin":"qiānshèng wàn jì","english_explanation":"a multitude of chariots and horses"},{"chengyu":"千差万别","pinyin":"qiānchā-wànbié","english_explanation":"varying greatly; having a diverse range; multifarious难民来自不同的社会阶层，其语言、文化、政治与宗教信仰千差万别。Nànmín lái zì bùtóng de shèhuì jiēcéng, qí yǔyán, wénhuà, zhèngzhì yǔ zōngjiào xìnyǎng qiānchā-wànbié.Refugees come from different social classes and have a diversity of languages, cultures and political and religious beliefs."},{"chengyu":"千里之行，始于足下","pinyin":"qiānlǐ zhī xíng, shǐyú zúxià","english_explanation":"a journey of a thousand miles begins with a single step"},{"chengyu":"千里姻缘一线牵","pinyin":"qiān lǐ yīnyuán yīxiàn qiān","english_explanation":"true love will remain, despite separation of great distances, even if by only a single thread"},{"chengyu":"半推半就","pinyin":"bàn tuī bàn jiù","english_explanation":"to be half willing (at heart) and half unwilling (in appearance)"},{"chengyu":"半斤八两","pinyin":"bànjīnbāliǎng","english_explanation":"six of one, half a dozen of the other"},{"chengyu":"半真半假","pinyin":"bànzhēnbànjiǎ","english_explanation":"half true half false, not sincere or truthful, elusive"},{"chengyu":"协力同心","pinyin":"xiélì tóngxīn","english_explanation":"to join forces; to work together toward a common goal"},{"chengyu":"卖官鬻爵","pinyin":"màiguān yù jué","english_explanation":"(archaic) to take bribes in exchange for granting an official or noble title"},{"chengyu":"南辕北辙","pinyin":"nán yuán běi zhé","english_explanation":"to be counterproductive; to run counter to; to work at cross-purposes; to sabotage your own progress; to go off in the wrong direction"},{"chengyu":"南郭处士","pinyin":"nánguō chǔshì","english_explanation":"a person without any real abilities who tries to blend in with professionals"},{"chengyu":"博学强记","pinyin":"bóxué qiángjì","english_explanation":"to have a lot of knowledge, and a good memory"},{"chengyu":"卧薪尝胆","pinyin":"wò xīn cháng dǎn","english_explanation":"to undergo self-imposed hardships; to nurse vengeance; to endure hardships to accomplish some ambition"},{"chengyu":"危在旦夕","pinyin":"wēi zài dànxī","english_explanation":"to be in imminent danger"},{"chengyu":"卿卿我我","pinyin":"qīng qīng wǒ wǒ","english_explanation":"whispers of love; lovers' talk; be very much in love; the intimate relations between man and woman"},{"chengyu":"历尽艰辛","pinyin":"lì jìn jiānxīn","english_explanation":"to have undergone all manner of hardships"},{"chengyu":"压倒骆驼的最后一根草","pinyin":"yādǎo luòtuó de zuìhòu yī gēn cǎo","english_explanation":"the straw that broke the camel's back"},{"chengyu":"又好笑，又好气","pinyin":"yòu hǎo xiào, yòu hǎo qì","english_explanation":"not know whether to laugh or get angry"},{"chengyu":"反唇相稽","pinyin":"fǎn chún xiāng jī","english_explanation":"to make a sarcastic remark rather than submit another's criticism; to rebut with sarcastic remarks; to make a sarcastic comeback; to talk back"},{"chengyu":"反唇相讥","pinyin":"fǎn chún xiāng jī","english_explanation":"to make a sarcastic remark rather than submit another's criticism; to rebut with sarcastic remarks; to make a sarcastic comeback; to talk backundated: Peoples net editorial staff, 怎样巧妙应付别人的奚落 (How to make clever comebacks to other people who are giving you a bad time)有一次，我看到一位长者在买菜时，说:\"你这菜太老了!\"卖菜者立即反唇相讥:\"还有你老啊!\"One time, I saw an elderly person buying vegetables who said, \"These vegetables of yours are too old!\" The vegetable seller immediately shot back with, \"Well, you're old too!\""},{"chengyu":"发奋图强","pinyin":"fāfèntúqiáng","english_explanation":"(Advanced Mandarin) to work diligently (ex. to make the country strong)"},{"chengyu":"发愤忘食","pinyin":"fāfèn wàng shí","english_explanation":"to study or work hard, neglecting one's meals; be so immersed in work as to forget one's meals"},{"chengyu":"变化莫测","pinyin":"biànhuà mòcè","english_explanation":"to metamorphose in an unpredictable way"},{"chengyu":"变本加厉","pinyin":"biànběnjiālì","english_explanation":"to get worse, to become aggravated, to intensify one's effort to do something wrong"},{"chengyu":"口蜜腹剑","pinyin":"kǒumìfùjiàn","english_explanation":"sweet words, but a wicked heart"},{"chengyu":"古往今来","pinyin":"gǔwǎngjīnlái","english_explanation":"through the ages"},{"chengyu":"只可意会，不可言传","pinyin":"zhǐ kě yìhuì, bù kě yánchuán","english_explanation":"can only be perceived, cannot explain it in words"},{"chengyu":"只许州官放火，不许百姓点灯","pinyin":"zhǐ xǔ zhōuguānfànghuǒ, bùxǔ bǎixìng diǎndēng","english_explanation":"a tyrant boss or leader can do whatever he likes, but the common people are not allowed the slightest bit of freedom"},{"chengyu":"叫天天不应，叫地地不灵","pinyin":"jiào tiān tiān bù yìng, jiào dì dì bù líng","english_explanation":"to be up the creek without a paddle; to be without any aid"},{"chengyu":"叫好不叫座","pinyin":"jiào hǎo bù jiào zuò","english_explanation":"describes a movie or play that receives critical acclaim but poor sales at the box office"},{"chengyu":"叫好又叫座","pinyin":"jiào hǎo yòu jiào zuò","english_explanation":"both a critical and box office success"},{"chengyu":"叫苦连天","pinyin":"jiào kǔ lián tiān","english_explanation":"to be full of complaints"},{"chengyu":"可歌可泣","pinyin":"kěgēkěqì","english_explanation":"(Advanced Mandarin) epic; moving"},{"chengyu":"可遇而不可求","pinyin":"kě yù ér bùkě qiú","english_explanation":"just have to let it happen, you can't force it"},{"chengyu":"司马昭之心","pinyin":"sīmǎzhāo zhī xīn","english_explanation":"evil ambitions that are transparent to everyone"},{"chengyu":"吃里扒外","pinyin":"chī lǐ pá wài","english_explanation":"to repay a kindness by stabbing someone in the back"},{"chengyu":"各奔前程","pinyin":"gè bēn qiánchéng","english_explanation":"(Advanced Mandarin) each pursues his own course; each goes his own way"},{"chengyu":"各怀一心","pinyin":"gè huái yī xīn","english_explanation":"everyone is of their own mind; nobody can agree on how to proceed"},{"chengyu":"各显神通","pinyin":"gè xiǎn shéntōng","english_explanation":"everybody using their talents to achieve a common goal"},{"chengyu":"合情合理","pinyin":"héqíng hélǐ","english_explanation":"(Advanced Mandarin) fair and reasonable; fair and sensible"},{"chengyu":"同工同酬","pinyin":"tónggōngtóngchóu","english_explanation":"equal pay for equal work男女同工同酬nánnǚ tónggōngtóngchóuMen and women should get equal pay for equal work."},{"chengyu":"同归于尽","pinyin":"tóngguīyújìn","english_explanation":"to perish together with your foe"},{"chengyu":"同心协力","pinyin":"tóngxīn xiélì","english_explanation":"to join forces; to work together toward a common goal"},{"chengyu":"同舟共济","pinyin":"tóng zhōu gòng jì","english_explanation":"We are in the same boat, so we should help each other."},{"chengyu":"名不见经传","pinyin":"míng bù jiàn jīngzhuàn","english_explanation":"a virtual unknown; a complete unknown; a dark horse"},{"chengyu":"名正言顺","pinyin":"míng zhèng yán shùn","english_explanation":"to use the proper wording to characterise something"},{"chengyu":"名花有主","pinyin":"míng huā yǒu zhǔ","english_explanation":"the beauty has already been one by somebody; she is spoken for"},{"chengyu":"后继无人","pinyin":"hòujìwúrén","english_explanation":"(idiomatic) having no successor or heir; figuratively referring to having no one to continue practising a skilled profession or a talent"},{"chengyu":"含情脉脉","pinyin":"hánqíngmòmò","english_explanation":"full of tender affection, (eyes) exuding tenderness and love"},{"chengyu":"吹毛求疵","pinyin":"chuī máo qiú cī","english_explanation":"to engage in fault-finding"},{"chengyu":"吹灰之力","pinyin":"chuī huī zhī lì","english_explanation":"with very little effort; easy; without so much as batting an eye; without so much as lifting a finger2006: 吴哥 (Wu Ge), 活塞射鹰不费吹灰之力 弗朗西斯复出魔术克奇才 (news article headline)活塞射鹰不费吹灰之力 弗朗西斯复出魔术克奇才 (simp.) 活塞射鷹不費吹灰之力 弗朗西斯複出魔術克奇才 (trad.)Pistons shoot down the Hawks without lifting a finger --- Francis' reappearance secures brilliant victory for the Magic"},{"chengyu":"吹皱一池春水","pinyin":"chuī zhòu yī chí chūn shuǐ","english_explanation":"to make waves; to cause ripples; to have an impact; cause a stir2006: Gameking staff, 盛大借休闲网游吹皱一池春水 (news article headline)盛大借休闲网游吹皱一池春水Shanda makes waves with casual web games"},{"chengyu":"周瑜打黄盖","pinyin":"Zhōu Yú dǎ Huáng Gài","english_explanation":"(xiehouyu) describes a situation in which one person is willing to abuse another person, while the other person is willing to bear the abuse"},{"chengyu":"呼风唤雨","pinyin":"hū fēng huàn yǔ","english_explanation":"to summon the wind and rain"},{"chengyu":"命世之才","pinyin":"mìngshì zhī cái","english_explanation":"a well known individual who has outstanding abilities"},{"chengyu":"咄咄逼人","pinyin":"duōduōbīrén","english_explanation":"to browbeat; overbearing"},{"chengyu":"和尚打伞，无法无天","pinyin":"héshàng dǎ sǎn, wúfǎwútiān","english_explanation":"(xiehouyu) no respect for law and order; unruly"},{"chengyu":"和平共处","pinyin":"hépíng gòngchǔ","english_explanation":"(Advanced Mandarin) peaceful coexistence"},{"chengyu":"咎由自取","pinyin":"jiù yóu zì qǔ","english_explanation":"have only oneself to blame"},{"chengyu":"哄笑","pinyin":"hōngxiào","english_explanation":"to break into laughter; to roar with laughter"},{"chengyu":"哪壶不开提哪壶","pinyin":"nǎ hú bù kāi tí nǎ hú","english_explanation":"to air somebody's dirty laundry"},{"chengyu":"唇亡齿寒","pinyin":"chún wáng chǐ hán","english_explanation":"share a common lot; share the same fate"},{"chengyu":"唇若涂脂","pinyin":"chún ruò tú zhī","english_explanation":"describes lips which are red and plump"},{"chengyu":"唯利是图","pinyin":"wéi lì shì tú","english_explanation":"to be bent solely on profit"},{"chengyu":"唾手可得","pinyin":"tuò shǒu kě dé","english_explanation":"extremely easy to obtain"},{"chengyu":"喊声震天","pinyin":"hǎnshēng zhèntiān","english_explanation":"loud screams and shouting seemingly shakes the heavens"},{"chengyu":"喜怒不形于色","pinyin":"xǐ nù bùxíngyúsè","english_explanation":"one's facial expression does not reveal any emotion; to not reveal any emotion on one's face"},{"chengyu":"嗤之以鼻","pinyin":"chī zhī yǐ bí","english_explanation":"to sneer"},{"chengyu":"器宇轩昂","pinyin":"qìyǔ xuānáng","english_explanation":"one has a dignified bearing"},{"chengyu":"四两拨千斤","pinyin":"sì liǎng bō qiān jīn","english_explanation":"a huge return for a very small investment; a big payoff for a small effort"},{"chengyu":"四分五裂","pinyin":"sìfēn wǔliè","english_explanation":"to be rent by disunity; to disintegrate"},{"chengyu":"四平八稳","pinyin":"sì píng bā wěn","english_explanation":"completely stable and safe"},{"chengyu":"四海一家","pinyin":"sìhǎi yījiā","english_explanation":"the world is a big family"},{"chengyu":"四面楚歌","pinyin":"sì miàn chǔ gē","english_explanation":"facing hostility, difficulty, or frustration on all sidesこの失敗 (しっぱい)で私 (わたし)はまったくの四面楚歌 (しめんそか)に追 (お)い込 (こ)まれてしまった。kono shippai de watashi wa mattaku no shimensoka ni oikomareteshimatta.As a result of this failure, I am now completely cut off and surrounded."},{"chengyu":"回家吃自己","pinyin":"huíjiā chī zìjǐ","english_explanation":"to be fired; You're fired!"},{"chengyu":"回眸一笑","pinyin":"huímóuyīxiào","english_explanation":"coquettish smile; smile coquettishly2006: anon., ent.people.com.cn鞏俐亮相黃金甲香港首映回眸一笑不慎露點 (trad.) 巩俐亮相黄金甲香港首映回眸一笑不慎露点 (simp.)Smiling coquettishly at the Hong Kong premiere of Curse of the Golden Flower, Gong Li reveals more cleavage than she bargained for"},{"chengyu":"国色天香","pinyin":"guósè tiānxiāng","english_explanation":"beautiful (as refers to a woman or a peony flower)"},{"chengyu":"坐不安席","pinyin":"zuò bù ān xí","english_explanation":"uneasy; unable to sit still; nervous"},{"chengyu":"坐井观天","pinyin":"zuòjǐngguāntiān","english_explanation":"ignorant of the world"},{"chengyu":"坚贞不屈","pinyin":"jiānzhēn bùqū","english_explanation":"(Advanced Mandarin) faithful and unyielding"},{"chengyu":"垂手可得","pinyin":"chuí shǒu kě dé","english_explanation":"(Taiwan) extremely easy to obtain"},{"chengyu":"声东击西","pinyin":"shēngdōngjīxī","english_explanation":"during a battle, to create the illusion of assaulting a target; but the true goal is to assault another target where it's least expected"},{"chengyu":"声名狼藉","pinyin":"shēngmínglángjí","english_explanation":"infamous, having an extremely bad reputation"},{"chengyu":"夕阳西下","pinyin":"xìyáng xī xià","english_explanation":"when the sun sets in the west; at dusk"},{"chengyu":"多劳多得","pinyin":"duōláoduōdé","english_explanation":"(Intermediate Mandarin) the harder one works, the more one gets paid"},{"chengyu":"多历年所","pinyin":"duō lì niánsuǒ","english_explanation":"(archaic) for many years"},{"chengyu":"多采多姿","pinyin":"duō cǎi duō zī","english_explanation":"colorful; many-faceted"},{"chengyu":"大刀阔斧","pinyin":"dàdāo kuò fǔ","english_explanation":"To handle something with daring and resolve; to be bold and decisive when handling an issue; drastic2001: yangtse.com staff, 南京市大刀阔斧“放权” (Nanjing to implements broad \"empowering\" measures)南京市将大刀阔斧地对延续几十年的行政审批制度进行全面改革.The city of Nanjing will carry out drastic and comprehensive reforms to its administrative vetting and approval system; a system which has lasted for several decades."},{"chengyu":"大包大揽","pinyin":"dàbāodàlǎn","english_explanation":"(Advanced Mandarin) to undertake a task (or contract) all by oneself"},{"chengyu":"大同小异","pinyin":"dà tóng xiǎo yì","english_explanation":"almost the same; almost identical; similar in most respects"},{"chengyu":"大处着眼，小处着手","pinyin":"dà chù zhuóyǎn, xiǎo chù zhuóshǒu","english_explanation":"keep the general goal in sight, while taking hold of the daily tasks"},{"chengyu":"大开方便之门","pinyin":"dà kāi fāngbiàn zhī mén","english_explanation":"do someone a big favor"},{"chengyu":"大惊小怪","pinyin":"dà jīng xiǎo guài","english_explanation":"to make a fuss over a trivial matter"},{"chengyu":"大意失荊州","pinyin":"dàyì shī jīngzhōu","english_explanation":"to have a temporary lapse in judgement that results in a major defeat; make a bad call and lose the farm我们绝对不能因轻敌而“大意失荆州”。 (simp.) 我們絕對不能因輕敵而“大意失荊州”。 (trad.)We absolutely must not regard the enemy too lightly, and thereby make a bad call and lose the farm."},{"chengyu":"大摇大摆","pinyin":"dàyáodàbǎi","english_explanation":"walking with an air of arrogance and nonchalance"},{"chengyu":"大放厥词","pinyin":"dàfàngjuécí","english_explanation":"to talk a lot of nonsense, to let out a spate of stuff and nonsense"},{"chengyu":"大有可为","pinyin":"dà yǒu kě wéi","english_explanation":"(Advanced Mandarin) to be well worth doing; to have great prospects"},{"chengyu":"大海捞针","pinyin":"dà hǎi lāo zhēn","english_explanation":"find a needle in a haystack"},{"chengyu":"大眼瞪小眼","pinyin":"dà yǎn dèng xiǎo yǎn","english_explanation":"two people staring at each other; without knowing what to do"},{"chengyu":"大红大紫","pinyin":"dàhóng dà zǐ","english_explanation":"to become very popular"},{"chengyu":"大而化之","pinyin":"dà ér huà zhī","english_explanation":"to not take something seriously; to not pay attention to details"},{"chengyu":"大门不出，二门不迈","pinyin":"dàmén bù chū, èr mén bù mài","english_explanation":"to never leave home, and have little contact with the outside world; to live a sheltered life"},{"chengyu":"大雨如注","pinyin":"dàyǔ rú zhù","english_explanation":"pouring down rain"},{"chengyu":"大零蛋","pinyin":"dàlíngdàn","english_explanation":"(slang) a big fat zero (a terrible score)"},{"chengyu":"天上人间","pinyin":"tiānshàng rénjiān","english_explanation":"(literally) heaven and earth"},{"chengyu":"天下大乱","pinyin":"tiānxià dàluàn","english_explanation":"the world is in chaos"},{"chengyu":"天下归心","pinyin":"tiānxià guīxīn","english_explanation":"to win over the support and trust of the entire nation"},{"chengyu":"天下本无事，庸人自扰之","pinyin":"tiānxià běn wúshì, yōngrénzìrǎo zhī","english_explanation":"to not think things through, and thereby create unnecessary trouble for oneself; to try to fix something that was not broken in the first place处女座容易陷入天下本无事庸人自扰之的情绪中，根本都没有什么事情发生，心情要放开一点不要想太多。Virgos will find it easy to fall into the trap of feeling like they should try to fix something that was not broken in the first place. Nothing has actually happened, so relax and don't overthink things."},{"chengyu":"天下父母心","pinyin":"tiānxià fùmǔ xīn","english_explanation":"the love of a parent"},{"chengyu":"天外飞来一笔","pinyin":"tiān wài fēi lái yībǐ","english_explanation":"Insert a sentence into a place where it is completely unrelated to what came before or after it; To say or do something out of left field.2006: anon, 高层主管的决定不实用怎么办 (What to do when a decision by senior management is not practical)面对大老板天外飞来一笔的决策，常令人无所适从，基层员工该如何应变？People who are faced with a policy from the big boss that comes out of left field are often at a loss as to what to do. How is a low level employee to respond?"},{"chengyu":"天心人意","pinyin":"tiānxīn rényì","english_explanation":"the will of heaven and the desire of men"},{"chengyu":"天摧地塌","pinyin":"tiān cuī dì tā","english_explanation":"a great commotion"},{"chengyu":"天旋地转","pinyin":"tiānxuándìzhuǎn","english_explanation":"to feel as if the sky and earth were spinning round; to feel very dizzy"},{"chengyu":"天时地利人和","pinyin":"tiānshí dìlì rénhé","english_explanation":"conditions required for success; knock on wood; if everything goes according to plan; with a little luck; everything goes right2004: anon., 04新郎雅典站 (04 Athens Website)天时地利人和加努力女排的这枚金牌命中注定With a little luck and some hard work, the women's volleyball team will be a shoe-in for the gold medal."},{"chengyu":"天机不可泄漏","pinyin":"tiānjī bùkě xièlòu","english_explanation":"it's a secret"},{"chengyu":"天涯若比邻","pinyin":"tiānyá ruò bìlín","english_explanation":"^ Most commentaries explain that 城阙 (watch towers on the city walls) is a reference to the capital city of Chang'an. One other possibility is that it refers to the watch towers of the town where Vice-prefect Du is to be assigned. According to this interpretation, the author is expressing praise for the prestige of his friend's future assignment (lit. The watch towers of the town where you will be assigned provide protection to the three Qin states)."},{"chengyu":"天灵灵，地灵灵","pinyin":"tiān líng líng, dì líng líng","english_explanation":"a spell said by a wizard or shaman (similar to abracadabra)"},{"chengyu":"天若有情天亦老","pinyin":"tiān ruò yǒu qíng tiān yì lǎo","english_explanation":"If Heaven had feelings, heaven too would grow old. (Things are sad and bleak and there is no justice in the world.)"},{"chengyu":"天长地久","pinyin":"tiānchángdìjiǔ","english_explanation":"(Advanced Mandarin) enduring as the universe; everlasting and unchanging806: Bai Juyi, Song of Everlasting Regret天长地久有时尽，此恨绵绵无绝期。As long as the universe lasts, and until time stops for good, the regret of our parting will continue without end."},{"chengyu":"天高皇帝远","pinyin":"tiān gāo huángdì yuǎn","english_explanation":"describes remote areas beyond the control of a central government2000: anon, 咨询型法治与中国国情 (The control of information and China's national mood)传统的中国是“一盘散沙”，名义上是“专制国家”，其实是个“天高皇帝远”的“文化范畴”。Traditional China was a loose confederation. Nominally, it was an \"autocratic state,\" but actually belonged to a \"category of civilizations\" whereby \"remote areas were beyond the control of a central government.\""},{"chengyu":"太岁头上动土","pinyin":"tàisuì tóu shàng dòngtǔ","english_explanation":"to offend or provoke the most powerful; to provoke somebody far superior in power or strength"},{"chengyu":"失之交臂","pinyin":"shī zhī jiāo bì","english_explanation":"to narrowly miss a golden opportunity (to meet someone etc.)"},{"chengyu":"夸父追日","pinyin":"Kuā Fù zhuī rì","english_explanation":"to not know one's limitations; to overestimate one's abilities"},{"chengyu":"夸父逐日","pinyin":"Kuā Fù zhú rì","english_explanation":"to not know one's limitations; to overestimate one's abilities"},{"chengyu":"夹缝中求生存","pinyin":"jiáfèng zhōng qiú shēngcún","english_explanation":"try to remain neutral without succumbing to pressure from either side"},{"chengyu":"奇花异草","pinyin":"qíhuāyìcǎo","english_explanation":"(Advanced Mandarin) exotic flowers and rare grass"},{"chengyu":"奋不顾身","pinyin":"fèn bù gù shēn","english_explanation":"to fight without regard to one's personal safety"},{"chengyu":"女大十八变","pinyin":"nǚ dà shí bā biàn","english_explanation":"All of the changes that a girl makes when turning into a woman; blossom into womanhood2005: Ma Chiyuan (马驰原), http://book.sina.com.cn 新浪读书 (sina.com literature page)小时候，徐妈妈对自己这个难看的小女儿十分失望。但是，女大十八变，小S如今已经成为亭亭玉立的小天鹅。When she was small, momma Xu was thoroughly distressed about her own daughter's homely appearance. But after having blossomed into womanhood, Little S has become a statuesque little swan."},{"chengyu":"好利忘义","pinyin":"hàolì wàng yì","english_explanation":"to abandon principles for the sake of personal (monetary) gain"},{"chengyu":"好心没好报","pinyin":"hǎoxīn méi hǎo bào","english_explanation":"no good deed goes unpunished; those who help often end up being resented by those whom they help"},{"chengyu":"好戏还在后头","pinyin":"hǎo xì hái zài hòutóu","english_explanation":"the best is yet to come"},{"chengyu":"好气又好笑","pinyin":"hǎo qì yòu hǎo xiào","english_explanation":"to not know whether to laugh or get angry"},{"chengyu":"好管闲事","pinyin":"hào guǎn xiánshì","english_explanation":"like to stick one's nose in other's affairs"},{"chengyu":"好色之徒","pinyin":"hàosè zhī tú","english_explanation":"a person who is fond of women; a lady's man; a womanizer"},{"chengyu":"好谋","pinyin":"hàomóu","english_explanation":"to be fond of scheming"},{"chengyu":"好谋无断","pinyin":"hàomóu wú duàn","english_explanation":"to be fond of scheming but lacking in judgement"},{"chengyu":"好贤礼士","pinyin":"hào xián lǐ shì","english_explanation":"to prize men of virtue and to show courtesy to talented men of letters"},{"chengyu":"好高骛远","pinyin":"hào gāo wù yuǎn","english_explanation":"bite off more than one can chew"},{"chengyu":"如之奈何","pinyin":"rú zhī nàihé","english_explanation":"(archaic) what can be done; there's no choice"},{"chengyu":"如入无人之境","pinyin":"rú rù wúrénzhījìng","english_explanation":"to fight without fear (as if the enemy were nowhere in sight)"},{"chengyu":"如出一辙","pinyin":"rú chū yī zhé","english_explanation":"from the same mold; peas in a pod; exactly alike"},{"chengyu":"如履平地","pinyin":"rú lǚ píngdì","english_explanation":"very easily; as if it were nothing"},{"chengyu":"如履薄冰","pinyin":"rú lǚ bó bīng","english_explanation":"To tread on thin ice; to skate over thin ice; to be very careful; to act with extreme caution."},{"chengyu":"如醉如痴","pinyin":"rúzuìrúchī","english_explanation":"(Advanced Mandarin) spellbound; fascinated"},{"chengyu":"如雨骈集","pinyin":"rú yǔ piánjí","english_explanation":"(archaic) to gather together side by side in large numbers"},{"chengyu":"如雷灌耳","pinyin":"rú léi guàn ěr","english_explanation":"to reverberate like thunder"},{"chengyu":"如雷贯耳","pinyin":"rú léi guàn ěr","english_explanation":"to reverberate like thunder"},{"chengyu":"姜太公钓鱼","pinyin":"jiāng tài gōng diàoyú","english_explanation":"(xiehouyu) like the fish rising to Grand Duke Jiang's hookless and baitless line; a willing victim letting himself be caught of his own will"},{"chengyu":"娇生惯养","pinyin":"jiāoshēngguànyǎng","english_explanation":"having been indulged and spoiled since childhood"},{"chengyu":"娓娓动听","pinyin":"wěiwěi dòngtīng","english_explanation":"talk in an impressive way; smooth-spoken; speak with absorbing interest; vivid and interesting"},{"chengyu":"婀娜多姿","pinyin":"ēnuó duō zī","english_explanation":"graceful; well-poised"},{"chengyu":"孤力难为","pinyin":"gū lì nán wéi","english_explanation":"too difficult to accomplish by oneself"},{"chengyu":"孤陋寡闻","pinyin":"gūlòuguǎwén","english_explanation":"ignorant and ill-informed"},{"chengyu":"学以致用","pinyin":"xué yǐ zhì yòng","english_explanation":"to study for the purpose of application; to study something in order to apply it; to put into practice what has been learned"},{"chengyu":"守口如瓶","pinyin":"shǒukǒurúpíng","english_explanation":"to keep one's mouth shut; to remain tight-lipped放心，我會守口如瓶的。 (trad.)放心，我会守口如瓶的。 (simp.)Don't worry, my lips are sealed."},{"chengyu":"安之若素","pinyin":"ānzhīruòsù","english_explanation":"to bear hardship with equanimity; to regard wrongdoing with equanimity"},{"chengyu":"安分守己","pinyin":"ānfèn shǒujǐ","english_explanation":"to abide by the law and do one's duty; to be content with one's lot; to one's place"},{"chengyu":"安家立业","pinyin":"ān jiā lì yè","english_explanation":"to settle down"},{"chengyu":"安民恤众","pinyin":"ānmín xù zhòng","english_explanation":"to pacify and comfort the people"},{"chengyu":"完璧归赵","pinyin":"wánbì guī zhào","english_explanation":"to return something to its owner in good condition"},{"chengyu":"完蛋","pinyin":"wándàn","english_explanation":"(colloquial) be done for; be finished/destroyed; gone for the dogs, curtains (for someone)你要是把這件事兒說出去，咱們倆都完蛋。 (trad.) / 你要是把这件事儿说出去，咱们俩都完蛋。 (simp.) (ref.: Wenlin)Nǐ yàoshi bǎ zhè jiàn shìr shuō chūqù, zánmen liǎ dōu wándàn.If you tell people what we did, both of us will be done for."},{"chengyu":"审美疲劳","pinyin":"shěnměi píláo","english_explanation":"to see so much beauty that one does not appreciate it anymore"},{"chengyu":"家丑不可外扬","pinyin":"jiāchǒu bù kě wài yáng","english_explanation":"(slang) don't wash your dirty linen in public"},{"chengyu":"宾至如归","pinyin":"bīn zhì rú guī","english_explanation":"guests feel at home (in a hotel, guesthouse etc.)"},{"chengyu":"密密麻麻","pinyin":"mìmìmámá","english_explanation":"densely packed; dense and numerous"},{"chengyu":"察言观色","pinyin":"chá yán guān sè","english_explanation":"to read a person (to interpret or infer a meaning or significance based on facial expression, tone of voice etc)"},{"chengyu":"寡不敌众","pinyin":"guǎ bù dí zhòng","english_explanation":"to be hopelessly outnumbered; to fight against hopeless odds"},{"chengyu":"寸步不离","pinyin":"cùn bù bù lí","english_explanation":"to tag; to follow closely"},{"chengyu":"寸步难行","pinyin":"cùnbù nán xíng","english_explanation":"cannot walk a step"},{"chengyu":"对牛弹琴","pinyin":"duìniútánqín","english_explanation":"(idiomatic) like talking to a brick wall, like casting pearls before swine"},{"chengyu":"对答如流","pinyin":"duìdá rú liú","english_explanation":"answer fluently; answer without hesitation"},{"chengyu":"寻根究底","pinyin":"xúngēnjiùdǐ","english_explanation":"to get to the bottom of the matter"},{"chengyu":"将计就计","pinyin":"jiāng jì jiù jì","english_explanation":"to turn somebody's trick against him; to beat somebody at his own game"},{"chengyu":"小题大作","pinyin":"xiǎotídàzuò","english_explanation":"to make a fuss over a trifling matter"},{"chengyu":"小鸟依人","pinyin":"xiǎo niǎo yī rén","english_explanation":"the appearance of a woman or a child who is dependant upon others, and is also dainty and cute"},{"chengyu":"尖酸刻薄","pinyin":"jiānsuān kèbó","english_explanation":"unsympathetic; merciless; pitiless"},{"chengyu":"尸横遍野","pinyin":"shī héng biànyě","english_explanation":"dead corpses blanketed the countryside"},{"chengyu":"尽心竭力","pinyin":"jìnxīn jiélì","english_explanation":"to do something with all one's heart and all one's might"},{"chengyu":"层出不穷","pinyin":"céng chū bù qióng","english_explanation":"(Advanced Mandarin) to emerge in an endless stream"},{"chengyu":"屈己","pinyin":"qūjǐ","english_explanation":"(literary) to humbly subjugate oneself"},{"chengyu":"屈己待人","pinyin":"qūjǐ dàirén","english_explanation":"to humbly subjugate oneself in service to someone else"},{"chengyu":"屋漏更遭连夜雨","pinyin":"wū lòu gèng zāo liányè yǔ","english_explanation":"describes when a string of unlucky events occur in rapid succession"},{"chengyu":"山崩地裂","pinyin":"shānbēng dì liè","english_explanation":"describes how a place looks after a great natural catastrophe; massively destructive2006: anon., 中国地震信息网 (China earthquake news net)这次地震发生在当地时间凌晨，人们还在睡梦中被山崩地裂般的地震惊醒，无数房屋在一瞬间轰然倒坍，许多人卒不及防就死于梦中。. (simp.) 這次地震發生在當地時間凌晨，人們還在睡夢中被山崩地裂般的地震驚醒，無數房屋在一瞬間轟然倒坍，許多人卒不及防就死於夢中。 (trad.)This time, the earthquake occurred before dawn local time. People were still sound asleep when they were jolted awake by a massively destructive earthquake. In an instant, countless houses had collapsed, and many people had died in their sleep with no time to react."},{"chengyu":"山穷水尽","pinyin":"shān qióng shuǐ jìn","english_explanation":"having no more options, at the end of one's rope"},{"chengyu":"山重水复","pinyin":"shān chóng shuǐ fù","english_explanation":"over numerous mountains and streams"},{"chengyu":"山青水秀","pinyin":"shān qīng shuǐ xiù","english_explanation":"picturesque scenery"},{"chengyu":"岁寒三友","pinyin":"suìhán sānyǒu","english_explanation":"three friends of winter: pine, bamboo and plum blossom"},{"chengyu":"岁月不饶人","pinyin":"suìyuè bù ráorén","english_explanation":"used for lamenting the passage of time"},{"chengyu":"岳撼山崩","pinyin":"yuè hàn shān bēng","english_explanation":"a great commotion"},{"chengyu":"崇山峻岭","pinyin":"chóngshān jùnlǐng","english_explanation":"high mountains and lofty peaks"},{"chengyu":"川流不息","pinyin":"chuān liú bù xī","english_explanation":"(Advanced Mandarin) flowing past in an endless stream"},{"chengyu":"州官放火","pinyin":"zhōu guān fànghuǒ","english_explanation":"a tyrant boss or leader can do whatever he likes, but the common people are not allowed the slightest bit of freedom"},{"chengyu":"左冲右突","pinyin":"zuǒ chōng yòu tū","english_explanation":"to attack with speed and ferocity"},{"chengyu":"左邻右舍","pinyin":"zuǒ lín yòu shè","english_explanation":"neighbors"},{"chengyu":"差强人意","pinyin":"chāqiángrényì","english_explanation":"just passable; fair; adequate; barely acceptable; not that great; just ok; not the bomb"},{"chengyu":"己所不欲，勿施于人","pinyin":"jǐsuǒbùyù wùshīyúrén","english_explanation":"do unto others as you would have done unto you"},{"chengyu":"应天顺人","pinyin":"yìng tiān shùn rén","english_explanation":"to conform to the wishes of both heaven and the people"},{"chengyu":"废嫡立庶","pinyin":"fèi dí lì shù","english_explanation":"(archaic) to depose the son of the empress and replace him with the son of the emperor's concubine"},{"chengyu":"度日如年","pinyin":"dù rì rú nián","english_explanation":"days wear on like years"},{"chengyu":"开门七件事","pinyin":"kāimén qī jiàn shì","english_explanation":"daily necessities"},{"chengyu":"异口同声","pinyin":"yì kǒu tóng shēng","english_explanation":"speaking with one voice"},{"chengyu":"弃旧换新","pinyin":"qìjiù huànxīn","english_explanation":"to abandon the old and exchange it for the new"},{"chengyu":"弃暗投明","pinyin":"qì àn tóu míng","english_explanation":"to forsake darkness and come to the light; to forsake darkness for light"},{"chengyu":"弄假成真","pinyin":"nòng jiǎ chéng zhēn","english_explanation":"to turn simulation into reality unintentionally; fantasy becomes reality2003: anon. 相关新闻 (news items)校方自備人造煙霧熏倒學生消防演習“弄假成真” (trad.) 校方自备人造烟雾熏倒学生消防演习“弄假成真” (simp.)Fantasy becomes reality! School authorities create artifial smoke, cause students to faint from suffocation"},{"chengyu":"弄巧成拙","pinyin":"nòng qiǎo chéng zhuó","english_explanation":"to bungle an ingenious scheme"},{"chengyu":"弄虚作假","pinyin":"nòngxūzuòjiǎ","english_explanation":"(Advanced Mandarin) to practice fraud"},{"chengyu":"引虎入羊群","pinyin":"yǐn hǔ rù yáng qún","english_explanation":"to let a fox into the chicken coop"},{"chengyu":"张三李四","pinyin":"Zhāng Sān Lǐ Sì","english_explanation":"(idiomatic) Any Tom, Dick, or Harry; anyone or everyone; random or unknown people不管张三李四，犯了罪就得依法惩治。Without regard to anyone, if you commit a crime then you will be punished according to the law."},{"chengyu":"弥天亘地","pinyin":"mítiān gèndì","english_explanation":"(literary) to be everywhere; to be pervasive"},{"chengyu":"弱水三千，只取一瓢饮","pinyin":"ruòshuǐsānqiān, zhǐ qǔ yī piáo yǐn","english_explanation":"there are so many potential lovers to choose from, but you only pick one from among those potential lovers"},{"chengyu":"强不知以为知","pinyin":"qiáng bùzhī yǐwéi zhī","english_explanation":"to pretend to know something that one does not know"},{"chengyu":"强弓硬弩","pinyin":"qiáng gōng yìng nǔ","english_explanation":"strong and sturdy bows and crossbows"},{"chengyu":"归根到底","pinyin":"guīgēndàodǐ","english_explanation":"(Advanced Mandarin) in the final analysis"},{"chengyu":"当之无愧","pinyin":"dāng zhī wúkuì","english_explanation":"merit the reward; to be deserving; to be a good pick"},{"chengyu":"当饭吃","pinyin":"dāng fàn chī","english_explanation":"(slang) to regard as livelihood; to pay the bills"},{"chengyu":"彪腹狼腰","pinyin":"biāo fù láng yāo","english_explanation":"an abdomen like that of a small tiger and a waist like that of a wolf; strong and husky"},{"chengyu":"彼一时，此一时","pinyin":"bǐ yī shí, cǐ yī shí","english_explanation":"that was then, this is now"},{"chengyu":"彼众我寡","pinyin":"bǐ zhòng wǒ guǎ","english_explanation":"(literary) They are many and we are few (we are outnumbered)."},{"chengyu":"徐娘半老","pinyin":"xú niáng bàn lǎo","english_explanation":"the woman in her thirty-forties; be already in her middle age"},{"chengyu":"得不偿失","pinyin":"débùchángshī","english_explanation":"(Advanced Mandarin) the loss outweighs the gain"},{"chengyu":"得寸进尺","pinyin":"dé cùn jìn chǐ","english_explanation":"\"Gain an inch and ask for a yard\"; to be extremely greedy."},{"chengyu":"得未曾有","pinyin":"dé wèicéng yǒu","english_explanation":"there has never been anything like it"},{"chengyu":"得理不饶人","pinyin":"dé lǐ bù ráo rén","english_explanation":"become haughty or unreasonable if one's position has support"},{"chengyu":"得胜之师","pinyin":"déshèng zhī shī","english_explanation":"an army that is flush with victory; a victorious army"},{"chengyu":"得过且过","pinyin":"déguòqiěguò","english_explanation":"without discipline or planning"},{"chengyu":"德艺双馨","pinyin":"déyìshuāngxīn","english_explanation":"(idiomatic) being reputable for having both artistic skills and morals (especially when referring to an artist of any domain)"},{"chengyu":"德高望重","pinyin":"dé gāo wàng zhòng","english_explanation":"(said of a person) known and loved by all"},{"chengyu":"心宽体胖","pinyin":"xīn kuān tǐ pán","english_explanation":"carefree and contented; fit and happy"},{"chengyu":"心惊胆战","pinyin":"xīnjīngdǎnzhàn","english_explanation":"shake with fright"},{"chengyu":"心惊胆跳","pinyin":"xīn jīng dǎn tiào","english_explanation":"tremble with fear"},{"chengyu":"心服口服","pinyin":"xīn fú kǒu fú","english_explanation":"to be sincerely convinced; to be won over completely"},{"chengyu":"心照不宣","pinyin":"xīnzhào bùxuān","english_explanation":"A tacit understanding or verbal agreement."},{"chengyu":"心猿意马","pinyin":"xīnyuányìmǎ","english_explanation":"unable to concentrate, inattentive and vacillating"},{"chengyu":"心生一计","pinyin":"xīnshēngyījì","english_explanation":"to suddenly have an idea; to suddenly hatch a scheme in one's head"},{"chengyu":"心神恍惚","pinyin":"xīnshén huǎnghū","english_explanation":"to be out of sorts; to be agitated"},{"chengyu":"心腹之交","pinyin":"xīnfù zhī jiāo","english_explanation":"a bosom friend"},{"chengyu":"心高气傲","pinyin":"xīn gāo qì ào","english_explanation":"proud and arrogant"},{"chengyu":"忍辱偷生","pinyin":"rěnrǔ tōushēng","english_explanation":"to endure humiliation in order to remain alive"},{"chengyu":"忧喜交集","pinyin":"yōuxǐ jiāojí","english_explanation":"to not know whether to laugh or cry; to feel both happy and sad; to become filled with a mixture of sadness and joy"},{"chengyu":"怀才不遇","pinyin":"huái cái bù yù","english_explanation":"to have talent, but no opportunity to use it"},{"chengyu":"怒气填胸","pinyin":"nùqì tián xiōng","english_explanation":"to be steaming with anger"},{"chengyu":"怒目咬牙","pinyin":"nùmù yǎoyá","english_explanation":"extremely angry; enraged"},{"chengyu":"怕老婆","pinyin":"pàlǎopó","english_explanation":"to be henpecked; to be afraid of one's wife"},{"chengyu":"怨天尤人","pinyin":"yuàntiānyóurén","english_explanation":"to blame god and man; to blame everyone and everything but oneself"},{"chengyu":"恃宠而骄","pinyin":"shì chǒng ér jiāo","english_explanation":"to be conceited because one is in someone's good graces"},{"chengyu":"恨不相逢未嫁时","pinyin":"hèn bù xiāngféng wèi jià shí","english_explanation":"regret meeting a true lover only after one's marriage; What a pity that we didn't meet before you and I were married!"},{"chengyu":"恶名昭彰","pinyin":"èmíngzhāozhāng","english_explanation":"notorious"},{"chengyu":"恶名昭著","pinyin":"èmíngzhāozhù","english_explanation":"notorious"},{"chengyu":"恶向胆边生","pinyin":"è xiàng dǎn biān shēng","english_explanation":"to be so angry, that one reacts badly without even thinking; to lose it; to lose one's temper2006: anon., 酒后坏事 (Terrible deeds after drinking too much)酒后载着同醉的妻回家,前面空载出租车见到路边有客,突然急刹,妻因无挂安全带,一头撞向挡风玻璃,很伤!即恶向胆边生,与友人下车追打的士佬,令其三拳倒地,最后警车到,逃!A guy was taking his wife home after a night of drinking, when an empty taxicab in front of them saw a customer on the side of the road, and slammed on his breaks. The wife was not wearing a seatbelt, so her head slammed into the windshield, and she was hurt badly! The driver lost it, and got out of the car along with his buddy, and started beating up the taxicab driver. They laid him out after only a few punches, but then a cop car came, so they split!"},{"chengyu":"悔之晚矣","pinyin":"huǐ zhī wǎn yǐ","english_explanation":"it is (or will be) too late to regret"},{"chengyu":"悬梁刺股","pinyin":"xuánliáng cìgǔ","english_explanation":"to study diligently"},{"chengyu":"悲欢岁月","pinyin":"bēihuān suìyuè","english_explanation":"all the good and bad things that happened in the past; the old days; back in the day"},{"chengyu":"惊弓之鸟","pinyin":"jīng gōng zhī niǎo","english_explanation":"a panic stricken person"},{"chengyu":"惊惶失措","pinyin":"jīnghuáng shīcuò","english_explanation":"to be thrown into a panic; to be frightened out of one's wits; to be in a state of panic"},{"chengyu":"惟命是听","pinyin":"wéimìngshìtīng","english_explanation":"to follow orders as if one's life depended on it; to do what one is told without fail"},{"chengyu":"惠风和畅","pinyin":"huìfēng héchàng","english_explanation":"a gentle breeze is freely blowing"},{"chengyu":"想方设法","pinyin":"xiǎngfāng shèfǎ","english_explanation":"(Advanced Mandarin) to do everything possible; to try anything one can think of"},{"chengyu":"惹事生非","pinyin":"rěshì shēng fēi","english_explanation":"to incur unnecessary trouble; to stir up ill will"},{"chengyu":"惺惺相惜","pinyin":"xīngxīng xiāng xí","english_explanation":"to have a friendship based on intellectual compatability"},{"chengyu":"愁眉不展","pinyin":"chóuméi bù zhǎn","english_explanation":"to wear a sad or distressed expression"},{"chengyu":"意想不到","pinyin":"yìxiǎngbùdào","english_explanation":"to be unexpected, to be unanticipated"},{"chengyu":"愚公移山","pinyin":"yúgōng yí shān","english_explanation":"to be resolute in one's endeavor, no matter what hardships one encounters"},{"chengyu":"感激不尽","pinyin":"gǎnjībùjìn","english_explanation":"can't thank (somebody) enough"},{"chengyu":"慷他人之慨","pinyin":"kāng tārén zhī kài","english_explanation":"to be generous with other people's money; to be generous at the expense of others"},{"chengyu":"成也萧何，败也萧何","pinyin":"chéng yě xiāohé, bài yě xiāohé","english_explanation":"the key to his success is also his undoing"},{"chengyu":"成事不足，败事有余","pinyin":"chéng shì bùzú, bài shì yǒuyú","english_explanation":"always failing, never succeeding; plenty of failures, but not much success"},{"chengyu":"我不入地狱，谁入地狱","pinyin":"wǒ bù rù dìyù, shéi rù dìyù","english_explanation":"If I don't do it, who will?; If I don't help, who will?; Sacrifice oneself in order to save others"},{"chengyu":"截然不同","pinyin":"jiérán bùtóng","english_explanation":"to be completely different"},{"chengyu":"手头拮据","pinyin":"shǒutóu jiéjū","english_explanation":"short of money; in straitened circumstances; on a (tight) budget; on the rocks; in low water"},{"chengyu":"手心手背都是肉","pinyin":"shǒuxīn shǒubèi dōu shì ròu","english_explanation":"cannot choose between one or the other because you are fond of both"},{"chengyu":"手无寸铁","pinyin":"shǒu wú cùn tiě","english_explanation":"unarmed; bare-handed"},{"chengyu":"手起刀落","pinyin":"shǒu qǐ dāo luò","english_explanation":"(archaic) to cut down with one swift stroke of one's sword"},{"chengyu":"才华横溢","pinyin":"cáihuá héngyì","english_explanation":"full of talent; brimming with talent"},{"chengyu":"打成一片","pinyin":"dǎ chéng yīpiàn","english_explanation":"to combine into a whole"},{"chengyu":"打破砂锅问到底","pinyin":"dǎpò shāguō wèn dàodǐ","english_explanation":"to get to the bottom of something"},{"chengyu":"打草惊蛇","pinyin":"dǎ cǎo jīng shé","english_explanation":"act rashly and alert the enemy"},{"chengyu":"打落水狗","pinyin":"dǎ luò shuǐ gǒu","english_explanation":"to kick someone when they are down"},{"chengyu":"打落牙齿和血吞","pinyin":"dǎluò yáchǐ huò xiě tūn","english_explanation":"to silently endure all manner of insults and abuse"},{"chengyu":"打铁趁热","pinyin":"dǎtiěchènrè","english_explanation":"strike while the iron is hot"},{"chengyu":"扬汤止沸","pinyin":"yángtāngzhǐfèi","english_explanation":"to implement a temporary solution in order to avert a crisis"},{"chengyu":"扮猪吃老虎","pinyin":"bàn zhū chī lǎohǔ","english_explanation":"play the pig to eat the tiger"},{"chengyu":"扯弓搭箭","pinyin":"chě gōng dā jiàn","english_explanation":"to nock an arrow; to place an arrow on one's bow in preparation for firing"},{"chengyu":"找不着北","pinyin":"zhǎobuzháo běi","english_explanation":"(colloquial) to be lost and confused; to be unable to find one's direction"},{"chengyu":"承先启后","pinyin":"chéng xiān qǐ hòu","english_explanation":"inherit the teachings of previous generations in order to inspire future actions"},{"chengyu":"投机倒把","pinyin":"tóujī dǎobǎ","english_explanation":"(Advanced Mandarin) to engage in speculation and profiteering"},{"chengyu":"折箭為誓","pinyin":"zhéjiàn wéi shì","english_explanation":"to make a solemn pledge"},{"chengyu":"抛砖引玉","pinyin":"pāo zhuān yǐn yù","english_explanation":"A self-deprecating way to express the idea of offering one's own relatively worthless words, opinions or services in order to solicit the more valued words, opinions or services of others.20多年前，曾琦是第一個到廈門投資的港商，當時他想的就是當一個“拋磚引玉的人”，讓更多的港、澳、台、僑商回國投資。More than 20 years ago, Zeng Qi was the first Hong Kong businessman to go to Xiamen to invest. At the time, he thought of himself as a a plain rock that attracts jade, making it possible for even more businessmen from Hong Kong, Macao and Taiwan to return to the Motherland to invest."},{"chengyu":"报仇雪恨","pinyin":"bàochóu xuěhèn","english_explanation":"to exact revenge so as to settle a score"},{"chengyu":"报雠雪恨","pinyin":"bàochóu xuěhèn","english_explanation":"(archaic) to exact revenge so as to settle a score"},{"chengyu":"披肝沥胆","pinyin":"pī gān lì dǎn","english_explanation":"to talk without reserve; to have a heart to heart talk"},{"chengyu":"抱佛脚","pinyin":"bào Fó jiǎo","english_explanation":"(slang) to leave something to do at the last minute"},{"chengyu":"抱头鼠窜","pinyin":"bàotóu shǔcuàn","english_explanation":"to flee like a scared rabbit; to scurry away like a rat"},{"chengyu":"抽丝剥茧","pinyin":"chōusībōjiǎn","english_explanation":"to painstakingly get to the bottom of something; to struggle to understand a convoluted argument or issue"},{"chengyu":"拉山头","pinyin":"lā shāntóu","english_explanation":"to form a faction; to form into cliques"},{"chengyu":"招贤","pinyin":"zhāoxián","english_explanation":"(literary) to invite men of talent to one's side"},{"chengyu":"招贤纳士","pinyin":"zhāoxián nà shì","english_explanation":"to invite men of wisdom and valor to one's side"},{"chengyu":"招降纳顺","pinyin":"zhāoxiáng nàshùn","english_explanation":"(archaic) to entreat the enemy to surrender and allow those who are obedient (to the government) to rejoin society"},{"chengyu":"拜倒石榴裙下","pinyin":"bàidǎo shíliú qún xià","english_explanation":"to grovel at the feet of a beautiful woman; he is wrapped around her fingers; he is completely taken with her"},{"chengyu":"拨云见日","pinyin":"bō yún jiàn rì","english_explanation":"everything is getting back on track; things are finally back to normal after a period of hardship; after much hardship, one is able to see the light at the end of the tunnel"},{"chengyu":"拨开云雾见青天","pinyin":"bōkāi yúnwù jiàn qīngtiān","english_explanation":"everything is getting back on track; things are finally back to normal after a period of hardship; after much hardship, one is able to see the light at the end of the tunnel"},{"chengyu":"择主而事","pinyin":"zé zhǔ ér shì","english_explanation":"to choose a talented and wise lord under which to serve"},{"chengyu":"拼命三郎","pinyin":"pīnmìng sān láng","english_explanation":"workaholic"},{"chengyu":"持之有故","pinyin":"chízhīyǒugù","english_explanation":"one has a well founded view or opinion; one's views can be supported by facts or evidence"},{"chengyu":"指天为誓","pinyin":"zhǐ tiān wéi shì","english_explanation":"to take a solemn oath; to swear by the heavens; to vow to"},{"chengyu":"指手画脚","pinyin":"zhǐshǒuhuàjiǎo","english_explanation":"(Advanced Mandarin) to gesticulate; to make gestures"},{"chengyu":"按兵不动","pinyin":"ànbīng bù dòng","english_explanation":"to temporarily stand down one's army in order to wait and see how things develop; to \"hold one's horses\""},{"chengyu":"按劳分配","pinyin":"ànláofēnpèi","english_explanation":"(Advanced Mandarin) distribution (of benefits, pay etc.) according to one's job performance"},{"chengyu":"振笔疾书","pinyin":"zhènbǐ jí shū","english_explanation":"to write furiously; to write non-stop"},{"chengyu":"捅娄子","pinyin":"tǒng lóuzi","english_explanation":"to make a mess of something; to make a blunder; to get into trouble"},{"chengyu":"捕风捉影","pinyin":"bǔ fēng zhuō yǐng","english_explanation":"to make groundless accusations; to grasp at straws"},{"chengyu":"损人不利己","pinyin":"sǔn rén bù lì jǐ","english_explanation":"to harm others without gaining anything in the process"},{"chengyu":"换汤不换药","pinyin":"huàn tāng bù huàn yào","english_explanation":"the same medicine differently prepared; the same old stuff with a different label"},{"chengyu":"据理力争","pinyin":"jùlǐ lìzhēng","english_explanation":"to argue vigorously on the basis of sound reason or justice"},{"chengyu":"授人以柄","pinyin":"shòu rén yǐ bǐng","english_explanation":"to relinquish one's power or authority to someone else"},{"chengyu":"掎角","pinyin":"jǐjiǎo","english_explanation":"(literary) to divide one's military forces into two separate groups so that one can attack on two different fronts"},{"chengyu":"掎角之势","pinyin":"jǐjiǎo zhī shì","english_explanation":"to divide one's military forces into two separate groups so that one can attack on two different fronts"},{"chengyu":"探囊取物","pinyin":"tànnáng qǔ wù","english_explanation":"within one's grasp; extremely easy; like taking candy from a baby"},{"chengyu":"探头探脑","pinyin":"tàntóutànnǎo","english_explanation":"(Advanced Mandarin) to pop one's head in and look about"},{"chengyu":"接二连三","pinyin":"jiē'èrliánsān","english_explanation":"(Advanced Mandarin) one after another"},{"chengyu":"推来推去","pinyin":"tuīláituīqù","english_explanation":"(Advanced Mandarin) to push one another rudely"},{"chengyu":"掩目捕雀","pinyin":"yǎn mù bǔ què","english_explanation":"(literary) to deceive oneself"},{"chengyu":"掩目而捕燕雀","pinyin":"yǎn mù ér bǔ yànquè","english_explanation":"(literary) to deceive oneself"},{"chengyu":"措手不及","pinyin":"cuòshǒu bùjí","english_explanation":"to be caught unawares"},{"chengyu":"插翅难飞","pinyin":"chāchì nán fēi","english_explanation":"unable to escape"},{"chengyu":"握手言合","pinyin":"wòshǒu yán hé","english_explanation":"to reconcile; to become friends again2002: anon. 三字熟語(二)倒胃口... (Three character expressions (2) unappetizing)在談判結束握手言合後，他又放冷箭惡意中傷我，真是卑鄙無恥。 (trad.) 在谈判结束握手言合后，他又放冷箭恶意中伤我，真是卑鄙无耻。 (simp.)It was really shameful how he stabbed me in the back and maliciously hurt me, even after we had already concluded our talks and reconciled."},{"chengyu":"搖旗擂鼓","pinyin":"yáo qí léigǔ","english_explanation":"(archaic) wave banners and beat the drums (of war)"},{"chengyu":"摘胆剜心","pinyin":"zhāi dǎn wān xīn","english_explanation":"to be determined to exact revenge"},{"chengyu":"摸不着头脑","pinyin":"mō bù zháo tóunǎo","english_explanation":"to be unable make head or tail of something"},{"chengyu":"摸着石头过河","pinyin":"mō zhe shítóu guò hé","english_explanation":"(xiehouyu) to figure things out as one goes; to take things one step at a time"},{"chengyu":"擎天驾海","pinyin":"qíngtiān jià hǎi","english_explanation":"unusually talented; able to do extraordinary things"},{"chengyu":"擐甲持戈","pinyin":"huànjiǎ chí gē","english_explanation":"(archaic) describes someone who is armed and ready for battle"},{"chengyu":"支离破碎","pinyin":"zhīlí pòsuì","english_explanation":"torn to pieces; all broken up"},{"chengyu":"攻其无备，出其不意","pinyin":"gōng qí wú bèi, chū qí bù yì","english_explanation":"catch somebody unawares"},{"chengyu":"放浪形骸","pinyin":"fànglàng xínghái","english_explanation":"to refuse to be bound by convention; to abandon oneself to Bohemianism"},{"chengyu":"救人如救火","pinyin":"jiù rén rú jiùhuǒ","english_explanation":"said or written by a person who is in desparate need of assistance; help me!!!; help!!!"},{"chengyu":"救困扶危","pinyin":"jiù kùn fúwēi","english_explanation":"to come to the assistance of those in crisis"},{"chengyu":"敢做敢当","pinyin":"gǎn zuò gǎn dāng","english_explanation":"willing to take action, then live with the consequences"},{"chengyu":"敬酒不吃吃罚酒","pinyin":"jìng jiǔ bù chī chī fá jiǔ","english_explanation":"to do things the hard way (as opposed to the easy way); to be compelled to do something after initially refusing"},{"chengyu":"斩将搴旗","pinyin":"zhǎn jiàng qiān qí","english_explanation":"to soundly defeat an enemy"},{"chengyu":"斩草除根","pinyin":"zhǎn cǎo chúgēn","english_explanation":"(Advanced Mandarin) to root out; to nip in the budc. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 2若不斩草除根，必为丧身之本。If you don't nip this in the bud, it will eventually be the death of you."},{"chengyu":"斩钉截铁","pinyin":"zhǎndīngjiétiě","english_explanation":"(Advanced Mandarin) resolute and decisive; categorical"},{"chengyu":"断章取义","pinyin":"duànzhāngqǔyì","english_explanation":"to take something out of context"},{"chengyu":"旁若无人","pinyin":"páng ruò wú rén","english_explanation":"to selfishly do what one wants without regard to other people's wishes"},{"chengyu":"旌旗蔽日","pinyin":"jīngqí bìrì","english_explanation":"describes a vast and mighty army"},{"chengyu":"无人之境","pinyin":"wúrénzhījìng","english_explanation":"a place that is devoid of people"},{"chengyu":"无何有之乡","pinyin":"wú hé yǒu zhī xiāng","english_explanation":"a place that lacks things"},{"chengyu":"无关大体","pinyin":"wúguān dàtǐ","english_explanation":"to have no bearing or influence on the overall situation"},{"chengyu":"无可奉告","pinyin":"wúkě fènggào","english_explanation":"(Advanced Mandarin, literary) nothing to say (in a diplomatic context); no comment"},{"chengyu":"无家可归","pinyin":"wú jiā kě guī","english_explanation":"to wander about without a home to go back to; to be homelessc. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 11操闻报大惊曰：「兖州有失，使吾无家可归矣，不可不亟图之！」Cao was shocked when he heard the report, saying, \"If Yanzhou is lost, I will no longer have a home to return to. I must come up with a plan and fast!\""},{"chengyu":"无心插柳柳成荫","pinyin":"wúxīn chā liǔ liǔ chéng yìn","english_explanation":"to do something which unintentionally returns positive results"},{"chengyu":"无所不用其极","pinyin":"wú suǒ bùyòng qí jí","english_explanation":"to stop at nothing"},{"chengyu":"无所作为","pinyin":"wú suǒ zuòwéi","english_explanation":"(Advanced Mandarin) to attempt nothing and accomplish nothing; to be in a state of inertia"},{"chengyu":"无所遁形","pinyin":"wú suǒ dùn xíng","english_explanation":"nowhere to hide"},{"chengyu":"无法无天","pinyin":"wúfǎwútiān","english_explanation":"no respect for law and order; unruly"},{"chengyu":"无用武之地","pinyin":"wú yòngwǔ zhī dì","english_explanation":"there is no place where one's talents can be displayed"},{"chengyu":"无精打彩","pinyin":"wú jīng dǎ cǎi","english_explanation":"listless; lackadaisical2008: Qin Yong (秦俑), 化妆可是有一段，陆小璐突然变得无精打采起来，虽然天天还是一大早就起来化妆，试穿漂亮衣服，但她的精神明显没有过去好。One day though Lu suddenly turned listless. Even though she still put on makeup in the morning and tried on clothes, she was no longer in such a good mood as she used to be."},{"chengyu":"无精打采","pinyin":"wú jīng dǎ cǎi","english_explanation":"listless; lackadaisical"},{"chengyu":"无计可施","pinyin":"wú jì kě shī","english_explanation":"at one's wits' end; at the end of one's tether"},{"chengyu":"无论如何","pinyin":"wúlùnrúhé","english_explanation":"in any case; at any rate; whatever happens; no matter what"},{"chengyu":"无话不谈","pinyin":"wúhuàbùtán","english_explanation":"for there to be nothing between two people that is not spoken, no topic that is taboo; to talk about anything and everything, symbolising a close relationship in which no secrets are kept"},{"chengyu":"既往不咎","pinyin":"jì wǎng bù jiù","english_explanation":"to let bygones be bygones"},{"chengyu":"既生瑜，何生亮","pinyin":"jì shēng yú, hé shēng liàng","english_explanation":"used to lament the fact that there is someone better than you who is outshining you at every turn; to bemoan a new contender2005: anon., 程实：微软掐架索尼 游戏机既生瑜何生亮 (news article headline)微软掐架索尼 游戏机既生瑜何生亮 (simp.) 微軟掐架索尼 遊戲機既生瑜何生亮 (trad.)Microsoft dukes it out with Sony; Video game console makers bemoan the new contender"},{"chengyu":"日出而作，日入而息","pinyin":"rìchū ér zuò, rì rù ér xí","english_explanation":"up when the sun is out, resting when its dark (as in the days of old)"},{"chengyu":"日积月累","pinyin":"rì jī yuè léi","english_explanation":"accumulate over a long period"},{"chengyu":"日行千里","pinyin":"rì xíng qiānlǐ","english_explanation":"able to travel great distances in a single day"},{"chengyu":"早知今日，何必当初","pinyin":"zǎo zhī jīnrì, hébìdāngchū","english_explanation":"to regret something you did in the past"},{"chengyu":"时不可失","pinyin":"shí bùkě shī","english_explanation":"there is not a moment to lose; we mustn't let this opportunity pass us by"},{"chengyu":"旷世逸才","pinyin":"kuàngshì yìcái","english_explanation":"outstanding and exceptionally talented"},{"chengyu":"明目张胆","pinyin":"míngmùzhāngdǎn","english_explanation":"brazenly; flagrantly"},{"chengyu":"明知就里","pinyin":"míngzhī jiùlǐ","english_explanation":"to clearly understand the inside scoop (story)"},{"chengyu":"明知山有虎，偏向虎山行","pinyin":"míng zhī shān yǒu hǔ, piàn xiàng hǔ shān xíng","english_explanation":"to take a risk despite knowing the dangers involved"},{"chengyu":"明知故犯","pinyin":"míngzhī-gùfàn","english_explanation":"to deliberately do something one knows is wrong"},{"chengyu":"易子而食","pinyin":"yì zǐ ér shí","english_explanation":"the situation is dire (i.e. during wartime or famine)"},{"chengyu":"昙花一现","pinyin":"tánhuāyīxiàn","english_explanation":"like a flash in the pan, ephemeral, not longterm"},{"chengyu":"星月交辉","pinyin":"xīng yuè jiāohuī","english_explanation":"the glittering light from the stars and the moon intermingle in the night sky"},{"chengyu":"春暖花开","pinyin":"chūn nuǎn huā kāi","english_explanation":"during the warmth of spring all the flowers bloom"},{"chengyu":"春花秋月","pinyin":"chūn huā qiū yuè","english_explanation":"a metaphor for a wonderful time spent in a beautiful location"},{"chengyu":"暗暗自责","pinyin":"àn àn zì zé","english_explanation":"to blame oneself in private"},{"chengyu":"暗淡无光","pinyin":"àndànwúguāng","english_explanation":"having lost its previous lustre and brilliance, dim and unattractive"},{"chengyu":"暗箭伤人","pinyin":"ànjiànshāngrén","english_explanation":"to injure someone with unscrupulous or underhand means, to backstab"},{"chengyu":"暴尸于市","pinyin":"pùshī yú shì","english_explanation":"to lay out a corpse (of a criminal etc.) in the streets (as a warning)"},{"chengyu":"暴跳如雷","pinyin":"bào tiào rú léi","english_explanation":"to be infuriated; to be enraged; to be furious; to be hopping mad"},{"chengyu":"曲意逢迎","pinyin":"qūyì féngyíng","english_explanation":"to go out of one's way to curry favor"},{"chengyu":"更待何时","pinyin":"gèng dài héshí","english_explanation":"there's no time like the present; if not now then when"},{"chengyu":"曾经沧海难为水","pinyin":"céng jīng cānghǎi nán wéi shuǐ","english_explanation":"^ Legend has it that Yuan Zhen wrote these five poems after his wife passed away"},{"chengyu":"月光族","pinyin":"yuèguāngzú","english_explanation":"people who live from paycheck to paycheck"},{"chengyu":"月明如昼","pinyin":"yuè míng rú zhòu","english_explanation":"the moon shined as bright as if it were midday"},{"chengyu":"月白风清","pinyin":"yuèbái fēngqīng","english_explanation":"a bright moon and a gentle breeze; a pleasant evening"},{"chengyu":"有一搭没一搭","pinyin":"yǒu yī dā méi yī dā","english_explanation":"think of something to say without paying much heed to what one is saying"},{"chengyu":"有一顿，没一顿","pinyin":"yǒu yī dùn, méi yī dùn","english_explanation":"describes when someone cannot eat on a regular basis"},{"chengyu":"有两下子","pinyin":"yǒuliǎngxiàzi","english_explanation":"(Intermediate Mandarin) to have real skill; to know one's stuff"},{"chengyu":"有何不可","pinyin":"yǒu hé bùkě","english_explanation":"the sky is the limit; there's nothing that could not be accomplished; there is nothing to stop us"},{"chengyu":"有何面目","pinyin":"yǒu hé miànmù","english_explanation":"how can you have respect for yourself; how can you look at yourself in the mirror"},{"chengyu":"有勇无谋","pinyin":"yǒuyǒngwúmóu","english_explanation":"to be foolhardy; to be brave but to lack a strategic mind; all brawn and no brains"},{"chengyu":"有口无心","pinyin":"yǒukǒu wúxīn","english_explanation":"(Advanced Mandarin) to be sharp tongued but not malicious; to be highly critical but not really mean it"},{"chengyu":"有情人终成眷属","pinyin":"yǒu qíng rén zhōng chéng juànshǔ","english_explanation":"the lovers finally became a family"},{"chengyu":"有教无类","pinyin":"yǒu jiào wú lèi","english_explanation":"to provide education for all people without discrimination"},{"chengyu":"朋比为奸","pinyin":"péngbì wéi jiān","english_explanation":"to conspire to do evil"},{"chengyu":"望而生畏","pinyin":"wàng ér shēng wèi","english_explanation":"to be terrified by the sight of someone or something"},{"chengyu":"望风而靡","pinyin":"wàng fēng ér mǐ","english_explanation":"scattered by the winds"},{"chengyu":"朝夕难保","pinyin":"zhāoxī nánbǎo","english_explanation":"one's days are numbered; one is on the verge of death (or defeat etc.)"},{"chengyu":"朝气蓬勃","pinyin":"zhāoqì péngbó","english_explanation":"(Advanced Mandarin) full of vigor and vitality; spirited"},{"chengyu":"未蒙其利，先受其害","pinyin":"wèi méng qí lì, xiān shòu qí hài","english_explanation":"to receive damage from something long before getting any benefit from it"},{"chengyu":"术业有专攻","pinyin":"shù yè yǒu zhuāngōng","english_explanation":"to possess a knowledge of a special skill"},{"chengyu":"朱门酒肉臭","pinyin":"zhūmén jiǔròu chòu","english_explanation":"a life of luxury and extravagance"},{"chengyu":"杀一儆百","pinyin":"shāyījǐngbǎi","english_explanation":"(idiomatic) to warn by example"},{"chengyu":"杀身成仁","pinyin":"shā shēn chéng rén","english_explanation":"to die to achieve virtue; to die for a just cause"},{"chengyu":"杀鸡儆猴","pinyin":"shājījǐnghóu","english_explanation":"Kill the chicken to warn the monkey; make a public demonstration of punishing a wrongdoer in order to deter innocents who might mimic the example of the wrongdoer."},{"chengyu":"杀鸡取卵","pinyin":"shājīqǔluǎn","english_explanation":"to seek short term gain at the sacrifice of long term profit"},{"chengyu":"杀鸡给猴看","pinyin":"shā jī gěi hóu kàn","english_explanation":"to make an example out of someone to frighten others"},{"chengyu":"杂乱无章","pinyin":"záluàn wú zhāng","english_explanation":"disorderly and chaotic"},{"chengyu":"束手待毙","pinyin":"shùshǒu dàibì","english_explanation":"to fold one's hands and helplessly await death; to give oneself up for dead"},{"chengyu":"来无影去无踪","pinyin":"lái wú yǐng qù wú zōng","english_explanation":"to come without a shadow, and leave without a trace"},{"chengyu":"杯弓蛇影","pinyin":"bēi gōng shé yǐng","english_explanation":"a false alarm (self-created suspicion); atmosphere of fear and admonition"},{"chengyu":"杯水车薪","pinyin":"bēi shuǐ jū xīn","english_explanation":"too inadequate and useless; to no avail"},{"chengyu":"杯盘狼藉","pinyin":"bēi pán láng jí","english_explanation":"describes wine cups and plates spread over a dining table in disarray after a feast"},{"chengyu":"杯酒释兵权","pinyin":"bēi jiǔ shì bīng quán","english_explanation":"relinquish one's military command over a glass of wine"},{"chengyu":"析骸以爨","pinyin":"xī hái yǐ cuàn","english_explanation":"the situation is dire (i.e. during wartime or famine)"},{"chengyu":"林林总总","pinyin":"lín lín zǒng zǒng","english_explanation":"numerous; in great abundance"},{"chengyu":"柳下惠","pinyin":"Liǔxià Huì","english_explanation":"a faithful and upright person (usually refers to husbands)"},{"chengyu":"柳暗花明","pinyin":"liǔ àn huā míng","english_explanation":"an enchanting sight in springtime"},{"chengyu":"柳暗花明又一村","pinyin":"liǔānhuāmíng yòu yī cūn","english_explanation":"an enchanting sight in springtime"},{"chengyu":"柴米油盐酱醋茶","pinyin":"chái mǐ yóu yán jiàng cù chá","english_explanation":"daily necessities"},{"chengyu":"标新立异","pinyin":"biāo xīn lì yì","english_explanation":"to start something new just in order to be different; to be original"},{"chengyu":"树功立业","pinyin":"shùgōng lìyè","english_explanation":"to do great deeds; to accomplish great things and establish oneself; to make a name for oneself"},{"chengyu":"根深蒂固","pinyin":"gēnshēndìgù","english_explanation":"(Advanced Mandarin) deep-rooted; ingrained; inveterate"},{"chengyu":"桃园三结义","pinyin":"táo yuán sān jiéyì","english_explanation":"to become sworn brothers"},{"chengyu":"梁上君子","pinyin":"liáng shàng jūnzi","english_explanation":"a burglar; a thief"},{"chengyu":"横眉竖眼","pinyin":"héngméi shù yǎn","english_explanation":"to have a dirty look on one's face; to give someone a dirty look"},{"chengyu":"横行无忌","pinyin":"héngxíng wújì","english_explanation":"to run amuck; to run wild"},{"chengyu":"欢天喜地","pinyin":"huāntiān-xǐdì","english_explanation":"with boundless joy; overjoyed"},{"chengyu":"欣欣向荣","pinyin":"xīnxīn xiàngróng","english_explanation":"(Advanced Mandarin) thriving; flourishing; prosperous"},{"chengyu":"欺人太甚","pinyin":"qīréntàishèn","english_explanation":"to bully intolerably"},{"chengyu":"欺君罔上","pinyin":"qījūn wǎng shàng","english_explanation":"to deceive the emperor or monarch"},{"chengyu":"欺天罔地","pinyin":"qī tiān wǎng dì","english_explanation":"(literary) to deceive the gods of heaven and earth"},{"chengyu":"此地无银三百两","pinyin":"cǐdì wú yín sān bǎi liǎng","english_explanation":"a clumsy denial resulting in self-exposure; a very poor lie which reveals the truth; protest one's innocence too much"},{"chengyu":"此起彼落","pinyin":"cǐ qǐ bǐ luò","english_explanation":"(said of sounds) rising and falling; continuously"},{"chengyu":"步履维艰","pinyin":"bùlǚ wéi jiān","english_explanation":"to walk with great difficulty"},{"chengyu":"歪七竖八","pinyin":"wāiqīshùbā","english_explanation":"not straight or upright, twisted or slanted in different ways"},{"chengyu":"死不瞑目","pinyin":"sǐ bù míngmù","english_explanation":"to die with a grievance or regret"},{"chengyu":"死亦瞑目","pinyin":"sǐ yì míngmù","english_explanation":"to die without any regrets"},{"chengyu":"死无葬身之地","pinyin":"sǐ wú zàngshēn zhī dì","english_explanation":"to die a horrible or tragic death"},{"chengyu":"死生有命，富贵在天","pinyin":"sǐ shēng yǒu mìng, fùguì zài tiān","english_explanation":"Life and death is fated, riches and honor depend on the appointment of heaven."},{"chengyu":"残暴不仁","pinyin":"cánbào bùrén","english_explanation":"cruel and heartless"},{"chengyu":"比手划脚","pinyin":"bǐ shǒu huà jiǎo","english_explanation":"to use movement of either the hands or of some other body limb in order to supplement that which can not be expressed in words; to use sign language; to communicate by using hand gestures."},{"chengyu":"毫不费力","pinyin":"háo bù fèilì","english_explanation":"without the slightest effort; easily"},{"chengyu":"气宇轩昂","pinyin":"qìyǔ xuān'áng","english_explanation":"have an impressive bearing"},{"chengyu":"气谊相投","pinyin":"qì yì xiāngtóu","english_explanation":"to have forged a bond with each other on the basis of mutual aspirations and mutual goodwill"},{"chengyu":"水中捞月","pinyin":"shuǐzhōnglāoyuè","english_explanation":"to make a hopeless, futile or vain effort at doing something, to ask for the moon"},{"chengyu":"水深火热","pinyin":"shuǐ shēn huǒ rè","english_explanation":"to be in deep distress; to be in deep water"},{"chengyu":"水陆毕陈","pinyin":"shuǐlù bì chén","english_explanation":"to set out a full spread of delicacies from land and sea"},{"chengyu":"求生不得，求死不能","pinyin":"qiú shēng bùdé, qiú sǐ bùnéng","english_explanation":"between a rock and a hard place; in a bind; in a pickle"},{"chengyu":"汉贼不两立","pinyin":"hàn zéi bù liǎnglì","english_explanation":"one or the other has got to go; both cannot coexist in the same place; this town isn't big enough for the two of us"},{"chengyu":"江河日下","pinyin":"jiāng hé rì xià","english_explanation":"(idiomatic) to worsen by the day; to get worse with each passing day"},{"chengyu":"江翻海沸","pinyin":"jiāng fān hǎi fèi","english_explanation":"(literary) startlingly turbulent and chaotic (describing a loud sound); thunderous (noise)"},{"chengyu":"沉鱼落雁","pinyin":"chén yú luò yàn","english_explanation":"(said of women) extremely beautiful; drop-dead gorgeous"},{"chengyu":"没精打彩","pinyin":"méi jīng dǎ cǎi","english_explanation":"listless; lackadaisical"},{"chengyu":"没精打采","pinyin":"méi jīng dǎ cǎi","english_explanation":"listless; lackadaisical"},{"chengyu":"河东狮吼","pinyin":"hé dōng shī hǒu","english_explanation":"describes an overbearing wife"},{"chengyu":"法子","pinyin":"fǎzi","english_explanation":"(Intermediate Mandarin) method; way"},{"chengyu":"波光粼粼","pinyin":"bōguāng línlín","english_explanation":"(said of water) clear, bright and clean"},{"chengyu":"波涛汹涌","pinyin":"bōtāo xiōngyǒng","english_explanation":"(idiomatic) turbulent (said of waves)"},{"chengyu":"泥牛入海","pinyin":"ní niú rù hǎi","english_explanation":"a clay ox entering the sea; gone forever; to disappear without a trace"},{"chengyu":"泪下如雨","pinyin":"lèi xià rú yǔ","english_explanation":"tears flow down like rain"},{"chengyu":"泪如泉涌","pinyin":"lèi rú quán yǒng","english_explanation":"tears gush out as if from a spring"},{"chengyu":"泰然自若","pinyin":"tàiránzìruò","english_explanation":"being calm and composed even under the most stubborn and difficult of situations"},{"chengyu":"洋洋洒洒","pinyin":"yángyángsǎsǎ","english_explanation":"(of writing) at great length; voluminous"},{"chengyu":"洞房花烛夜","pinyin":"dòngfáng huā zhú yè","english_explanation":"the wedding night"},{"chengyu":"津津有味","pinyin":"jīnjīn yǒu wèi","english_explanation":"(Advanced Mandarin) with great relish; with keen pleasure; with gusto"},{"chengyu":"洪炉燎发","pinyin":"hónglú liáo fǎ","english_explanation":"(archaic) overkill; to go way overboard; to use a sledge hammer"},{"chengyu":"流芳百世","pinyin":"liúfāng bǎishì","english_explanation":"to leave a good name for a hundred generations"},{"chengyu":"浊酒粗食","pinyin":"zhuójiǔ cūshí","english_explanation":"(literary) murky wine and coarse food"},{"chengyu":"浴火重生","pinyin":"yùhuǒchóngshēng","english_explanation":"to be given a new lease on life after a tragedy"},{"chengyu":"海内一统","pinyin":"hǎinèi yītǒng","english_explanation":"the country is united"},{"chengyu":"海内人望","pinyin":"hǎinèi rénwàng","english_explanation":"(archaic) a person that all the people put their hopes in"},{"chengyu":"海内存知己，天涯若比邻","pinyin":"hǎinèi cún zhījǐ, tiānyáruòbìlín","english_explanation":"^ Most commentaries explain that 城阙 (watch towers on the city walls) is a reference to the capital city of Chang'an. One other possibility is that it refers to the watch towers of the town where Vice-prefect Du is to be assigned. According to this interpretation, the author is expressing praise for the prestige of his friend's future assignment (lit. The watch towers of the town where you will be assigned provide protection to the three Qin states)."},{"chengyu":"涂炭","pinyin":"tútàn","english_explanation":"(archaic) to be in a difficult circumstance"},{"chengyu":"涕泗横流","pinyin":"tìsì héngliú","english_explanation":"tears and mucus coming out sideways; to weep uncontrollably"},{"chengyu":"深根固本","pinyin":"shēn gēn gù běn","english_explanation":"entrenched; dug in"},{"chengyu":"深沟高垒","pinyin":"shēn gōu gāo lěi","english_explanation":"to dig deep trenches and build high defensive walls; to fortify one's position; to dig in"},{"chengyu":"添油加醋","pinyin":"tiānyóujiācù","english_explanation":"to add color and emphasis to (a narration), to exaggerate"},{"chengyu":"溃不成军","pinyin":"kuìbùchéngjūn","english_explanation":"badly defeated; soundly defeated"},{"chengyu":"源源不绝","pinyin":"yuányuán bùjué","english_explanation":"to flow continuously with out stopping; a stream; a continuous flow"},{"chengyu":"满腹经纶","pinyin":"mǎnfù jīnglún","english_explanation":"very erudite; very experienced"},{"chengyu":"满面春风","pinyin":"mǎnmiàn chūnfēng","english_explanation":"looking happy and cheerful; all smiles"},{"chengyu":"满面笑容","pinyin":"mǎnmiàn xiàoróng","english_explanation":"all smiles; grinning from ear to ear"},{"chengyu":"滥竽充数","pinyin":"lànyú chōngshù","english_explanation":"^ Because 南郭 has multiple meanings, the sentence could also be translated as:a. \"A reclusive scholar, from a city in the south, asked if he could play the yu for the king.\"b. \"A reclusive scholar, (whose surname was) Nanguo, asked if he could play the yu for the king.\""},{"chengyu":"漫山塞野","pinyin":"mànshān sè yě","english_explanation":"spread out all over the mountains and plains; numerous"},{"chengyu":"漫山遍野","pinyin":"mànshānbiànyě","english_explanation":"so numerous as to cover the mountains and the plains"},{"chengyu":"潜移默化","pinyin":"qiányímòhuà","english_explanation":"refers to when a person's attitude or personality is influenced by external factors which cause the person to change in ways that go unnoticed by the person"},{"chengyu":"灌水","pinyin":"guànshuǐ","english_explanation":"to irrigate; to water"},{"chengyu":"灯红酒绿","pinyin":"dēng hóng jiǔ lǜ","english_explanation":"scene of debauchery; feasting and revelry; indulge in gay life and debauchery"},{"chengyu":"燕颔虎须","pinyin":"yàn hàn hǔxū","english_explanation":"to have the look of someone rich and important"},{"chengyu":"爱不释手","pinyin":"àibùshìshǒu","english_explanation":"loving something too much to part with it"},{"chengyu":"爱莫能助","pinyin":"ài mò néng zhù","english_explanation":"unable to help, despite wanting to"},{"chengyu":"爱面子","pinyin":"ài miànzi","english_explanation":"(Advanced Mandarin) sensitive about one's reputation; afraid of losing face and being looked down upon"},{"chengyu":"片甲不回","pinyin":"piàn jiǎ bù huí","english_explanation":"to suffer total defeat"},{"chengyu":"物换星移","pinyin":"wù huàn xīng yí","english_explanation":"the change that accompanies the passage of time; as circumstances change over the years; in time2006: anon., zh:w:美国东北部 (Northeastern United States)在物换星移下，这些区域逐渐的被英国殖民者控制，但此区域仍然有著强壮的多样性。In time, all these settlements fell under English control, but the region continued to be a magnet for people of diverse nationalities."},{"chengyu":"犄角","pinyin":"jījiǎo","english_explanation":"(literary) to divide one's military forces into two separate groups so that one can attack on two different fronts"},{"chengyu":"犄角之势","pinyin":"jījiǎo zhī shì","english_explanation":"to divide one's military forces into two separate groups so that one can attack on two different fronts"},{"chengyu":"犬马之力","pinyin":"quǎnmǎ zhī lì","english_explanation":"(archaic) (to employ) one's humble strength (in service to one's ruler)"},{"chengyu":"犬马之报","pinyin":"quǎnmǎ zhī bào","english_explanation":"(archaic) a sincere effort to repay a favor"},{"chengyu":"狂风怒号","pinyin":"kuángfēng nùháo","english_explanation":"a violent wind is howling; the storm raged"},{"chengyu":"狐群狗党","pinyin":"húqúngǒudǎng","english_explanation":"a pack of rogues; a gang of scoundrels"},{"chengyu":"狗咬吕洞宾","pinyin":"gǒu yǎo Lǚ Dòngbīn","english_explanation":"bite the hand that feeds you"},{"chengyu":"狗改不了吃屎","pinyin":"gǒu gǎibùliǎo chī shǐ","english_explanation":"(slang) a leopard cannot change its spots"},{"chengyu":"狼吞虎咽","pinyin":"lángtūnhǔyàn","english_explanation":"to gorge; to wolf down"},{"chengyu":"狼心狗行","pinyin":"láng xīn gǒu xíng","english_explanation":"treacherous; greedy; shameless"},{"chengyu":"猛虎","pinyin":"měnghǔ","english_explanation":"(literary) a fierce tiger"},{"chengyu":"猫哭耗子假慈悲","pinyin":"māo kū hàozi jiǎ cíbēi","english_explanation":"to cry crocodile tears"},{"chengyu":"班门弄斧","pinyin":"bān mén nòng fǔ","english_explanation":"show off one's inferior talent or skill in front of an expert"},{"chengyu":"瓜田李下","pinyin":"guā tián lǐ xià","english_explanation":"a position that invites suspicion; liable to lay oneself open to suspicion; be found in a suspicious position; in suspicious circumstances or surroundings"},{"chengyu":"生拉硬拽","pinyin":"shēng lā yìng zhuài","english_explanation":"to drag somebody along kicking and screaming"},{"chengyu":"生擒活捉","pinyin":"shēngqín huózhuō","english_explanation":"to capture (the enemy) alive"},{"chengyu":"生米煮成熟饭","pinyin":"shēng mǐ zhǔ chéng shú fàn","english_explanation":"a metaphor for when something is already inevitable, and there is no way to reverse it; there is no turning back; what's done is done; you can't turn back the clock这件事已经生米煮成熟饭了，你应该勇敢的面对现实，思量解决之道。What's done is done. You should bravely face reality, and think of a solution."},{"chengyu":"用武","pinyin":"yòngwǔ","english_explanation":"to display one's abilities or talents"},{"chengyu":"由点到面","pinyin":"yóu diǎn dào miàn","english_explanation":"to expand out from one point"},{"chengyu":"画虎不成反类犬","pinyin":"huà hǔ bùchéng fǎn lèi quǎn","english_explanation":"to make a poor imitation"},{"chengyu":"画龙点睛","pinyin":"huàlóngdiǎnjīng","english_explanation":"to put on the finishing touches"},{"chengyu":"略无忌惮","pinyin":"lüè wú jìdàn","english_explanation":"brazen; brazenly"},{"chengyu":"略无禁惮","pinyin":"lüè wú jìn dàn","english_explanation":"brazen; brazenly"},{"chengyu":"疏财仗义","pinyin":"shūcái zhàngyì","english_explanation":"willing to disperse money in order to uphold justice"},{"chengyu":"登泰山而小天下","pinyin":"dēng Tài Shān ér xiǎo tiānxià","english_explanation":"able to see far and wide"},{"chengyu":"白刀子进，红刀子出","pinyin":"bái dāozi jìn hóng dāozi chū","english_explanation":"(colloquial) to kill; to murder2005: 小说推荐网, 异能高手在校园 正文 第230章 白刀子进，红刀子出刘雨菲从小到大从来没见过杀人地场面，今天可是亲眼看到了，那么真切又那么简单，就像人放狠话的时候说的￣￣白刀子进，红刀子出。Liu Yufei had never seen a murder his whole life, until today when he saw it with his own eyes. It happened so vividly, and yet so simply, like the ruthless saying, \"The knife goes in white and comes out red.\""},{"chengyu":"白驹过隙","pinyin":"bái jū guò xì","english_explanation":"the swiftness of the lapse of time"},{"chengyu":"百口莫辩","pinyin":"bǎi kǒu mò biàn","english_explanation":"unable to give a convincing explanation in self-defense"},{"chengyu":"百年好合","pinyin":"bǎiniánhǎohé","english_explanation":"(of a couple) staying in love for the rest of their lives, for better or worse (usually said during a wedding ceremony)"},{"chengyu":"百废俱兴","pinyin":"bǎi fèi jù xīng","english_explanation":"all neglected tasks are being undertaken; all that was left undone is now being undertaken"},{"chengyu":"百思不解","pinyin":"bǎisībùjiě","english_explanation":"incomprehensible"},{"chengyu":"百感交集","pinyin":"bǎigǎnjiāojí","english_explanation":"lots of emotions crowd into the heart"},{"chengyu":"百折不挠","pinyin":"bǎizhébùnáo","english_explanation":"indomitable, unfazed by difficulties or challenges"},{"chengyu":"百无一二","pinyin":"bǎi wú yī èr","english_explanation":"there are no more than a few people left"},{"chengyu":"百花齐放","pinyin":"bǎihuāqífàng","english_explanation":"describing the scene where all the flowers bloom synchronously"},{"chengyu":"皇天后土","pinyin":"huángtiān hòutǔ","english_explanation":"by the gods of heaven and earth"},{"chengyu":"皮笑肉不笑","pinyin":"pí xiào ròu bù xiào","english_explanation":"to put on a false smile"},{"chengyu":"目不暇给","pinyin":"mù bù xiá jǐ","english_explanation":"so many things come into sight that the eyes are kept fully occupied"},{"chengyu":"目不转睛","pinyin":"mù bù zhuǎn jīng","english_explanation":"to gaze into each other's eyes; to not take their eyes off of each other"},{"chengyu":"目不邪视","pinyin":"mù bù xiéshì","english_explanation":"to look straight ahead without casting any sidelong glances"},{"chengyu":"相貌堂堂","pinyin":"xiàngmàotángtáng","english_explanation":"a strong or stout appearance; someone who looks strong and imposing"},{"chengyu":"眉来眼去","pinyin":"méiláiyǎnqù","english_explanation":"to make eyes at each other; to flirt with each other"},{"chengyu":"眉清目秀","pinyin":"méi qīng mù xiù","english_explanation":"good looking; pleasant facial features"},{"chengyu":"看怎么说","pinyin":"kàn zěnme shuō","english_explanation":"(colloquial) it depends on how you look at it"},{"chengyu":"真才实学","pinyin":"zhēncái-shíxué","english_explanation":"real talent and sound scholarship"},{"chengyu":"眼不见为净","pinyin":"yǎn bù jiàn wéi jìng","english_explanation":"turn a blind eye to something"},{"chengyu":"眼不见，心不烦","pinyin":"yǎn bù jiàn xīn bù fán","english_explanation":"(slang) out of sight, out of mind"},{"chengyu":"眼睛长在头顶上","pinyin":"yǎnjīng zhǎng zài tóudǐng shàng","english_explanation":"to regard everyone as beneath one's notice"},{"chengyu":"眼花撩乱","pinyin":"yǎnhuā liáoluàn","english_explanation":"to be dazzled by the sight of something"},{"chengyu":"眼若流星","pinyin":"yǎn ruò liúxīng","english_explanation":"eyes (as bright as) shooting stars"},{"chengyu":"睁眼说瞎话","pinyin":"zhēng yǎn shuō xiāhuà","english_explanation":"to lie; to talk nonsense; to tell stories"},{"chengyu":"瞎子摸象","pinyin":"xiāzimōxiàng","english_explanation":"unable to see the big picture; only knowing what is on the surface"},{"chengyu":"瞎猫碰死耗子","pinyin":"xiāmāopèngsǐhàozǐ","english_explanation":"doing things based on luck and chance, not skill and expertise"},{"chengyu":"矢石如雨","pinyin":"shǐshí rúyǔ","english_explanation":"arrows and rocks falling down like rain (describing a ferocious battle)"},{"chengyu":"知书达礼","pinyin":"zhī shū dá lǐ","english_explanation":"well educated and well groomed"},{"chengyu":"知其不可而为","pinyin":"zhī qí bùkě ér wéi","english_explanation":"^ Mr. Kong (Confucius) was advocating morality during a time of chaos (a futile undertaking)."},{"chengyu":"知其然而不知其所以然","pinyin":"zhī qí rán ér bù zhī qí suǒyǐ rán","english_explanation":"to know the result without knowing the reason for the result"},{"chengyu":"石破天惊","pinyin":"shí pò tiān jīng","english_explanation":"world-shaking; sensational"},{"chengyu":"破涕为笑","pinyin":"pòtìwéixiào","english_explanation":"to turn from weeping to smiling, usually depicting a change in one's emotional state from being sad to being happy"},{"chengyu":"破烂不堪","pinyin":"pòlànbùkān","english_explanation":"so tattered and torn (especially said of clothing) that it is totally unacceptable to present oneself in public in such a state"},{"chengyu":"破釜沉舟","pinyin":"pòfǔchénzhōu","english_explanation":"to cross the Rubicon; to reach the point of no return"},{"chengyu":"破镜重圆","pinyin":"pòjìngchóngyuán","english_explanation":"to be reunited after a long period of separation (said of a couple)"},{"chengyu":"碎玉","pinyin":"suìyù","english_explanation":"(archaic) pearly white teeth (resembling shards of white jade)"},{"chengyu":"碧眼童颜","pinyin":"bì yǎn tóngyán","english_explanation":"describes a person who is old, but still has a youthful facec. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 1遇一老人，碧眼童颜，手执藜杖He came across an old man; the old man had a youthful countenance, and was carrying a walking stick fashioned from the hardened stalk of a goosefoot plant."},{"chengyu":"碰钉子","pinyin":"pèng dīngzi","english_explanation":"(Intermediate Mandarin) to meet with a rebuff"},{"chengyu":"礼尚往来","pinyin":"lǐ shàng wǎnglái","english_explanation":"to reciprocate the courtesy shown to you by another; to treat others as you would like to be treated"},{"chengyu":"礼贤下士","pinyin":"lǐ xián xià shì","english_explanation":"to show respect for men of talent and to not be condescending to men of average abilities"},{"chengyu":"神采奕奕","pinyin":"shéncǎi yìyì","english_explanation":"glowing with health and radiating vigor"},{"chengyu":"神魂飘荡","pinyin":"shénhún piāodàng","english_explanation":"to be mixed up and confused"},{"chengyu":"神龙见首不见尾","pinyin":"shén lóng jiàn shǒu bù jiàn wěi","english_explanation":"to maintain an air of mystery, to not reveal oneself; to play cat and mouse; to remain aloof2004: 郭凯 ed. (Guo Kai), 飞人“神龙见首不见尾” 乔丹没给中国男篮面子 (His Airness \"is a no where to be found,\" Jordan disses Chinese basketball players)在昨晚从广东抵达北京后，乔丹也始终采取“神龙见首不见尾”的方式与一干中国媒体和中国球迷捉迷藏。From the time Michael Jordan arrived in Beijing from Guangdong, he took the approach of remaining aloof, and played hide and seek with a slew of Chinese Media and fans."},{"chengyu":"祭神如神在","pinyin":"jì shén rú shén zài","english_explanation":"describes someone who is very devout"},{"chengyu":"祸在目前","pinyin":"huò zài mùqián","english_explanation":"disaster is upon us; disaster is imminent"},{"chengyu":"福大命大造化大","pinyin":"fú dà mìngdà zàohuà dà","english_explanation":"(slang) to be extremely fortunate and blessed2008: Living Green Dragon (在世青龙), 无法用科学解释的“福大命大”！图文集他多次歷險卻大難不死，按照我們中國人的傳統說法，他真的夠得上是「福大、命大、造化大」。 (trad.)他多次历险却大难不死，按照我们中国人的传统说法，他真的够得上是“福大、命大、造化大”。 (simp.)He escaped death many times. According to the traditional Chinese saying, he really is \"lucky, lucky, lucky.\""},{"chengyu":"秀才遇到兵","pinyin":"xiùcái yù dào bīng","english_explanation":"秀才遇到兵 - 有理說不清 (trad.) 秀才遇到兵 - 有理说不清 (simp.)a scholar meets a foot soldier and cannot not use reason with him"},{"chengyu":"秋毫无犯","pinyin":"qiūháo wú fàn","english_explanation":"to not even commit the slightest violation"},{"chengyu":"秋波送情","pinyin":"qiūbō sòng qíng","english_explanation":"(of a woman) to make eyes; to ogle; to cast amorous glances"},{"chengyu":"秋风扫落叶","pinyin":"qiūfēng sǎo luòyè","english_explanation":"to take by storm; to blow away (the competition); to blow out of the water2004: Mao Xuanlei (毛煊磊), www.sportsonline.com.cn中国羽球出线无悬念 击败对手如“秋风扫落叶”Chinese badminton team wins hands down, blows their opponents out of the water"},{"chengyu":"稠人广坐","pinyin":"chóurén guǎngzuò","english_explanation":"amongst all the people; in public"},{"chengyu":"穷困潦倒","pinyin":"qióngkùn liáodǎo","english_explanation":"fall on evil days; be penniless and frustrated; crack up under the strain of poverty; in a state of utter poverty; in the grip of poverty; live a life of poverty"},{"chengyu":"穷根究底","pinyin":"qiónggēnjiùdǐ","english_explanation":"to get to the bottom of the matter"},{"chengyu":"穿小鞋","pinyin":"chuān xiǎoxié","english_explanation":"(slang) to make things hard for someone by abusing one's power"},{"chengyu":"竖子不足与谋","pinyin":"shùzǐ bùzú yùmóu","english_explanation":"(archaic) This childish buffoon is not qualified to participate in strategic planning!"},{"chengyu":"童颜","pinyin":"tóngyán","english_explanation":"(literary) describes a person who is old, but still has a youthful facec. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 1遇一老人，碧眼童颜，手执藜杖He came across an old man, who had a youthful countenance, and was carrying a fat-hen walking stick."},{"chengyu":"童颜鹤发","pinyin":"tóngyán-hèfǎ","english_explanation":"white hair and ruddy complexion; healthy in old age; hale and hearty"},{"chengyu":"第一把交椅","pinyin":"dìyī bǎ jiāoyǐ","english_explanation":"the top banana; top of the heap"},{"chengyu":"管他三七二十一","pinyin":"guǎn tā sān qī èr shí yī","english_explanation":"don't care how; who cares how"},{"chengyu":"箭在弦上，不得不发","pinyin":"jiàn zài xián shàng, bùdébù fā","english_explanation":"there's no turning back now!"},{"chengyu":"粉身碎骨","pinyin":"fěnshēnsuìgǔ","english_explanation":"to have one's body smashed to pieces; to die the most cruel death"},{"chengyu":"粉骨碎身","pinyin":"fěngǔsuìshēn","english_explanation":"to have one's body smashed to pieces; to die the most cruel death"},{"chengyu":"粗心大意","pinyin":"cūxīn dàyì","english_explanation":"(Intermediate Mandarin) negligent; careless"},{"chengyu":"粗枝大叶","pinyin":"cūzhīdàyè","english_explanation":"careless; sloppy; over-generalized"},{"chengyu":"粗茶淡饭","pinyin":"cū chá dànfàn","english_explanation":"to lead a simple life; to live without without fancy food or drink"},{"chengyu":"精打细算","pinyin":"jīngdǎxìsuàn","english_explanation":"(Advanced Mandarin) careful calculation and strict budgeting"},{"chengyu":"精益求精","pinyin":"jīng yì qiú jīng","english_explanation":"(Advanced Mandarin) to keep improving; to constantly improve"},{"chengyu":"累卵","pinyin":"lěiluǎn","english_explanation":"(archaic) a precarious situation similar to when eggs are piled high and about to come tumbling down"},{"chengyu":"累卵之急","pinyin":"lěiluǎn zhī jí","english_explanation":"(archaic) a precarious situation similar to when eggs are piled high and about to come tumbling down"},{"chengyu":"红光紫雾","pinyin":"hóng guāng zǐ wù","english_explanation":"red rays of light and purple mist (considered to be a lucky omen)"},{"chengyu":"红粉佳人","pinyin":"hóngfěn jiārén","english_explanation":"a beautiful woman"},{"chengyu":"红透半边天","pinyin":"hóng tòu bànbiāntiān","english_explanation":"one's popularity is at its zenith"},{"chengyu":"纵横天下","pinyin":"zōnghéng tiānxià","english_explanation":"to enjoy free rein across the nation; to have license to do as one pleases anywhere in the country"},{"chengyu":"终日不倦","pinyin":"zhōngrì bùjuàn","english_explanation":"to not get tired the whole day long; to do something all day and not get tired"},{"chengyu":"经天纬地","pinyin":"jīngtiānwěidì","english_explanation":"(a talent for) managing affairs of state"},{"chengyu":"经天纬地之才","pinyin":"jīngtiānwěidì zhī cái","english_explanation":"an extraordinary talent (for managing affairs of state etc.)"},{"chengyu":"经宿不归","pinyin":"jīng sù bù guī","english_explanation":"to stay out all night long without returning home"},{"chengyu":"绑赴市曹","pinyin":"bǎng fù shìcáo","english_explanation":"(archaic) to carry out a public execution in a city center (as a warning to others)"},{"chengyu":"结草衔环","pinyin":"jiécǎo xiánhuán","english_explanation":"to repay a debt (of kindness etc.)c. 1590: Wu Cheng'en, Journey to the West/Chapter 37 (西游记/第037回)朕当结草衔环，报酬师父恩也。I must repay this debt of kindness, in order to show my gratitude to you."},{"chengyu":"绘声绘色","pinyin":"huì shēng huì sè","english_explanation":"vivid; lively; lifelike"},{"chengyu":"绝处逢生","pinyin":"juéchù féng shēng","english_explanation":"to get saved at a critical moment; to survive a crisis; to be unexpectedly rescued from a desparate situation"},{"chengyu":"绞尽脑汁","pinyin":"jiǎo jìn nǎozhī","english_explanation":"to rack one's brain"},{"chengyu":"维妙维肖","pinyin":"wéimiàowéixiào","english_explanation":"remarkably true to life; absolutely lifelike"},{"chengyu":"罪不容诛","pinyin":"zuì bùróng zhū","english_explanation":"even death cannot atone for the offense; guilty of crimes for which even death is insufficient punishment"},{"chengyu":"罪恶贯盈","pinyin":"zuì'è guànyíng","english_explanation":"one's evil deeds could fill volumes"},{"chengyu":"耀武扬威","pinyin":"yàowǔ yángwēi","english_explanation":"to prance about; to thump one's chest; to swagger about; to brag of one's military prowess"},{"chengyu":"老而不死是为贼","pinyin":"lǎo ér bù sǐ shì wéi zéi","english_explanation":"used to scold an old person who has no regard for others"},{"chengyu":"老鼠屎","pinyin":"lǎoshǔshǐ","english_explanation":"(idiomatic) bad apple"},{"chengyu":"耳熟能详","pinyin":"ěr shú néng xiáng","english_explanation":"heard a million times, to the point where one can recite it in one's sleep; well-worn (phrase)2004: Su Ping (苏萍), Shanghai Primary School以下就让我们来看一些耳熟能详的中文在英语中是如何表达的Below, let us take a look at how some well-worn Chinese phrases are expressed in English"},{"chengyu":"肆无忌惮","pinyin":"sìwújìdàn","english_explanation":"brazen, unbridled, wanton, unscrupulous"},{"chengyu":"肉颤心惊","pinyin":"ròu zhàn xīn jīng","english_explanation":"shaking with fear"},{"chengyu":"肚子里的蛔虫","pinyin":"dǔzi lǐ de huíchóng","english_explanation":"a mind reader; to read someone's mindundated: anon., www.chineseliterature.com.cn莉经常说辉是她肚子里的蛔虫，好多的事情都不用说，也就是心照不宣吧。Li often said that Hui could read her mind, there were many things that were implicitly understood without needing to be said out loud."},{"chengyu":"肝胆相照","pinyin":"gāndǎn xiāng zhào","english_explanation":"to show the deepest sincerity"},{"chengyu":"股掌之上","pinyin":"gǔ zhǎng zhī shàng","english_explanation":"under one's complete control"},{"chengyu":"肥头大耳","pinyin":"féi tóu dà ěr","english_explanation":"fat and pudgy"},{"chengyu":"背水一战","pinyin":"bèi shuǐ yī zhàn","english_explanation":"to be forced to stand and fight; to make a desperate last stand"},{"chengyu":"胶柱鼓瑟","pinyin":"jiāo zhù gǔsè","english_explanation":"to stubbornly stick to old ways"},{"chengyu":"胼手胝足","pinyin":"piánshǒuzhīzú","english_explanation":"long toiling"},{"chengyu":"脑满肠肥","pinyin":"nǎo mǎn cháng féi","english_explanation":"heavy jowled and pot bellied"},{"chengyu":"腾空而起","pinyin":"téngkōng ér qǐ","english_explanation":"to rise in the world by sheer effort and persistence"},{"chengyu":"自以为得计","pinyin":"zì yǐwéi dé jì","english_explanation":"to think mistakenly that one will ultimately succeed as the result of having accomplished only part of one's plan; because you won a single battle, you mistakenly think you will win the war"},{"chengyu":"自以为是","pinyin":"zì yǐwéi shì","english_explanation":"to consider oneself in the right; to regard oneself as infallible; self-righteous"},{"chengyu":"自天而下","pinyin":"zì tiān ér xià","english_explanation":"to happen all of the sudden; to happen out of the blue; to come out of nowhere"},{"chengyu":"自扫门前雪","pinyin":"zì sǎo mén qián xuě","english_explanation":"only worry about one's own affairs; to not involve oneself in other's affairs与人相处不应怀着自扫门前雪的心态，应当彼此关怀，互相帮助。When relating to others, one should not have an attitude of merely worrying about one's own affairs, we should care for and help one another."},{"chengyu":"自有公论","pinyin":"zì yǒu gōnglùn","english_explanation":"naturally have the support of the people; naturally have public opinion in one's favor"},{"chengyu":"自有道理","pinyin":"zì yǒu dàolǐ","english_explanation":"to have a plan or strategy already worked out in one's head"},{"chengyu":"自相残害","pinyin":"zì xiāng cánhài","english_explanation":"to bring about mutual harm"},{"chengyu":"自私自利","pinyin":"zìsīzìlì","english_explanation":"(Advanced Mandarin) selfish; self-centered"},{"chengyu":"自负盈亏","pinyin":"zìfù yíngkuī","english_explanation":"(Advanced Mandarin) to assume sole responsibility for profits and losses (of an enterprise etc.)"},{"chengyu":"臭名昭著","pinyin":"chòumíngzhāozhù","english_explanation":"notorious"},{"chengyu":"臭皮匠","pinyin":"chòupíjiàng","english_explanation":"(idiomatic) a person of mediocre talent"},{"chengyu":"舌灿莲花","pinyin":"shé càn liánhuā","english_explanation":"flamboyant and pleasant sounding speech"},{"chengyu":"舍近求远","pinyin":"shě jìn qiú yuǎn","english_explanation":"to abandon what is close at hand in favor of something far away; to go on a wild goose chase; to vainly pursue the impossible, while ignoring the possible"},{"chengyu":"色香味俱全","pinyin":"sè xiāng wèi jùquán","english_explanation":"the look, smell and taste (of a dish of food) are all excellent"},{"chengyu":"花好月圆","pinyin":"huā hǎo yuè yuán","english_explanation":"blooming flowers and full moon; perfect conjugal bliss"},{"chengyu":"花心萝卜","pinyin":"huāxīn luóbo","english_explanation":"a playboy; a cad; a womanizer"},{"chengyu":"苍翠欲滴","pinyin":"cāngcuì yù dī","english_explanation":"luscious; so green, water is about to drip out"},{"chengyu":"若无其事","pinyin":"ruòwúqíshì","english_explanation":"calm, composed"},{"chengyu":"茂林修竹","pinyin":"màolín xiūzhú","english_explanation":"an exuberant growth of trees and bamboos"},{"chengyu":"草木皆兵","pinyin":"cǎo mù jiē bīng","english_explanation":"describes a situation in which someone is being overly paranoid"},{"chengyu":"草菅人命","pinyin":"cǎojiānrénmìng","english_explanation":"to regard human life as if it were as worthless as straw"},{"chengyu":"莫名其妙","pinyin":"mòmíngqímiào","english_explanation":"puzzling; baffling; inexplicable"},{"chengyu":"莫报万一","pinyin":"mò bào wànyī","english_explanation":"cannot even repay one ten thousandth of what has been done on one's behalf"},{"chengyu":"莫敢谁何","pinyin":"mò gǎn shuí hé","english_explanation":"nobody dare (stop him or get in his way)"},{"chengyu":"落井下石","pinyin":"luò jǐng xià shí","english_explanation":"to kick someone when they are down"},{"chengyu":"落花有意，流水无情","pinyin":"luò huā yǒuyì, liúshuǐ wúqíng","english_explanation":"describes unrequited love"},{"chengyu":"落荒","pinyin":"luòhuāng","english_explanation":"(literary) to flee while staying off of the main roads and highways"},{"chengyu":"落荒而走","pinyin":"luòhuāng ér zǒu","english_explanation":"to flee in a hurry; to flee in panic"},{"chengyu":"落荒而逃","pinyin":"luòhuāng ér táo","english_explanation":"to be a fugitive from justice; to be at large; to go on the lamb"},{"chengyu":"落落大方","pinyin":"luò luò dàfāng","english_explanation":"poised and uninhibited"},{"chengyu":"葬身之地","pinyin":"zàngshēn zhī dì","english_explanation":"(to die) without a place to bury one's body"},{"chengyu":"藕断丝连","pinyin":"ǒu duàn sī lián","english_explanation":"the ties are severed, but not completely; to still have a thing for somebody; to still pine for somebody"},{"chengyu":"虎体熊腰","pinyin":"hǔtǐxióngyāo","english_explanation":"broad shoulders, like those of a tiger, and sturdy hips, like those of a bear"},{"chengyu":"虎体狼腰","pinyin":"hǔ tǐ láng yāo","english_explanation":"describes someone with an imposing or majestic bearing"},{"chengyu":"虎体猿臂","pinyin":"hǔ tǐ yuán bì","english_explanation":"a body like that of a tiger and arms like those of an ape"},{"chengyu":"虎入羊群","pinyin":"hǔ rù yáng qún","english_explanation":"a fox in the chicken coop"},{"chengyu":"虎无爪，鸟无翼","pinyin":"hǔ wú zhuǎ, niǎo wú yì","english_explanation":"a useless individual"},{"chengyu":"虚无缥缈","pinyin":"xūwúpiǎomiǎo","english_explanation":"purely imaginary; entirely unreal; visionary; illusory"},{"chengyu":"行不改名，坐不改姓","pinyin":"xíng bù gǎi míng, zuò bù gǎi xìng","english_explanation":"to do things in an aboveboard and straightforward manner"},{"chengyu":"行坐不安","pinyin":"xíng zuò bù ān","english_explanation":"so nervous that one doesn't know whether to walk or sit"},{"chengyu":"衣不解带","pinyin":"yī bù jiě dài","english_explanation":"to diligently work on behalf of someone"},{"chengyu":"衣锦还乡","pinyin":"yī jǐn huán xiāng","english_explanation":"to return home after making good; to return home in glory"},{"chengyu":"衣食无缺","pinyin":"yī shí wú quē","english_explanation":"no problems with one's life"},{"chengyu":"表里一致","pinyin":"biǎolǐ yīzhì","english_explanation":"the same on both the inside and out; honest and sincere; to mean what one says"},{"chengyu":"装门面","pinyin":"zhuāng ménmiàn","english_explanation":"to put up a facade; to keep up appearances"},{"chengyu":"西装革履","pinyin":"xīzhuāng gélǚ","english_explanation":"(esp. of a person) trendy in their taste of clothing"},{"chengyu":"要钱不要命","pinyin":"yào qián bù yào mìng","english_explanation":"do anything for money"},{"chengyu":"要风得风，要雨得雨","pinyin":"yào fēng dé fēng, yào yǔ dé yǔ","english_explanation":"to get whatever one wants"},{"chengyu":"见利忘义","pinyin":"jiàn lì wàng yì","english_explanation":"to forget one's principles whenever tempted by the prospect of personal gain"},{"chengyu":"解铃还须系铃人","pinyin":"jiě líng hái xū xì líng rén","english_explanation":"The only one who can fix the problem is the one who created the problem."},{"chengyu":"触景生情","pinyin":"chù jǐng shēng qíng","english_explanation":"be moved by what one sees; memories revive at the sight of familiar places; the scene brings back memories"},{"chengyu":"触目惊心","pinyin":"chùmù jīngxīn","english_explanation":"frightening; bloodcurdling"},{"chengyu":"言不尽意","pinyin":"yán bù jìn yì","english_explanation":"what one says does not sufficiently express what one means"},{"chengyu":"言之成理","pinyin":"yánzhīchénglǐ","english_explanation":"what one says is reasonable"},{"chengyu":"计将安出","pinyin":"jì jiāng ān chū","english_explanation":"where (or how) will one come up with a plan"},{"chengyu":"误人子弟","pinyin":"wùrén zǐdì","english_explanation":"to lead students astray"},{"chengyu":"说时迟，那时快","pinyin":"shuō shí chí, nà shí kuài","english_explanation":"before you know it; immediately; presto"},{"chengyu":"诸如此类","pinyin":"zhūrú cǐ lèi","english_explanation":"(Advanced Mandarin) and so forth and so on"},{"chengyu":"诸葛亮借东风","pinyin":"Zhūgě Liàng jiè dōngfēng","english_explanation":"a brilliant plan"},{"chengyu":"读书破万卷","pinyin":"dúshū pò wàn juàn","english_explanation":"describes someone who is well-read读书破万卷，下笔如有神。well read, and an accomplished writer"},{"chengyu":"谈笑自若","pinyin":"tánxiào zìruò","english_explanation":"to go on talking and laughing as if nothing had happened"},{"chengyu":"谋臣武将","pinyin":"móuchén wǔjiàng","english_explanation":"cunning ministers and brave generals"},{"chengyu":"豁然开朗","pinyin":"huòrán kāilǎng","english_explanation":"to suddenly see the light; to be suddenly enlightened"},{"chengyu":"豹头猿臂","pinyin":"bào tóu yuán bì","english_explanation":"describes someone with an imposing and majestic bearing"},{"chengyu":"豹头环眼","pinyin":"bàotóuhuányǎn","english_explanation":"(literary) describes a fierce looking man"},{"chengyu":"败兵折将","pinyin":"bài bīng zhé jiàng","english_explanation":"to suffer a major defeat in battle resulting in the loss of a number of soldiers and generals"},{"chengyu":"贪多嚼不烂","pinyin":"tān duō jiáo bú làn","english_explanation":"bite off more than one can chew"},{"chengyu":"贪心不足","pinyin":"tānxīn bùzú","english_explanation":"insatiable greed or covetousness"},{"chengyu":"贯斗牛","pinyin":"guàn dòuniú","english_explanation":"(archaic) (of heroism etc.) bright and strong; for all to see"},{"chengyu":"赏功罚罪","pinyin":"shǎng gōng fá zuì","english_explanation":"to reward people for meritorious deeds and to punish them for their crimes"},{"chengyu":"趴趴走","pinyin":"pāpāzǒu","english_explanation":"(Taiwan) to run all over the place; to go all over the place; to rush about or around"},{"chengyu":"踏破铁鞋无觅处，得来全不费工夫","pinyin":"tàpòtiěxiéwúmìchù, dé lái quán bù fèigōngfu","english_explanation":"(xiehouyu) wear out iron shoes searching for something with no success, only to acquire it by accident through no effort of one's own"},{"chengyu":"蹦蹦跳跳","pinyin":"bèng bèng tiào tiào","english_explanation":"bouncing and vivacious"},{"chengyu":"身在曹营心在汉","pinyin":"shēn zài cáo yíng xīn zài hàn","english_explanation":"subjugated by one authority, while still remaining loyal to another; not loyal2006: anon., finance.nen.com.cn不少大学生身在曹营心在汉 刚签约就想跳槽A growing number of university graduates are not loyal to their employers; right after they've signed a contract of employment, they're already thinking of jumping ship"},{"chengyu":"车同轨，书同文","pinyin":"chē tóng guǐ, shū tóng wén","english_explanation":"universal standards2003: anon., www.oikos.com.tw微软 Office 2003 新成员继 OneNote 之后，昨天再发表Office InfoPath，展现微软在信息世界中「车同轨，书同文」的企图The newest member of Microsoft Office 2003 follows on the heels of Microsoft OneNote; yesterday, Office InfoPath was announced. It displays Microsoft's attempt to create \"universal standards\" for the information technology world"},{"chengyu":"轻于鸿毛","pinyin":"qīng yú hóngmáo","english_explanation":"lighter (and less significant) than a wild goose feather"},{"chengyu":"边都沾不上","pinyin":"biān dōu zhān bù shàng","english_explanation":"way off; not even close; way off the mark; dead wrong; off by a mile"},{"chengyu":"过五关斩六将","pinyin":"guò wǔ guān zhǎn liù jiàng","english_explanation":"get past all manner of hardships"},{"chengyu":"迎头赶上","pinyin":"yíngtóu gǎnshàng","english_explanation":"proceed with determination; catch up forthwith; come up from behind; work [try] hard to catch up"},{"chengyu":"进退两难","pinyin":"jìntuìliǎngnán","english_explanation":"between a rock and a hard place"},{"chengyu":"进退维谷","pinyin":"jìntuì wéi gǔ","english_explanation":"between a rock and a hard place"},{"chengyu":"进酒作乐","pinyin":"jìnjiǔ zuòlè","english_explanation":"(literary) to pour wine for somebody and then toast them as one talks and laughs with that person"},{"chengyu":"连...带...","pinyin":"lián...dài...","english_explanation":"(Advanced Mandarin) and; as well as全家连大带小都病倒Everyone in their family, both old and young, came down with the illness."},{"chengyu":"连滚带爬","pinyin":"liángǔndàipá","english_explanation":"(Advanced Mandarin) rolling and crawling (describes a scene in which people are chaotically fleeing every which way from danger)"},{"chengyu":"迫不得已","pinyin":"pòbùdéyǐ","english_explanation":"being forced to, not having a choice"},{"chengyu":"追根究底","pinyin":"zhuīgēnjiùdǐ","english_explanation":"to get to the bottom of the matter"},{"chengyu":"适得其反","pinyin":"shì dé qí fǎn","english_explanation":"to run counter to one's desire; to have the exact opposite effect of what one wished"},{"chengyu":"逆水行舟","pinyin":"nì shuǐ xíng zhōu","english_explanation":"to diligently engage in one's studies (like a boat going against the currents)"},{"chengyu":"逐水草而居","pinyin":"zhú shuǐcǎo ér jū","english_explanation":"to live a nomadic lifestyle"},{"chengyu":"遗臭万年","pinyin":"yí chòu wànnián","english_explanation":"to go down in history as a byword of infamy"},{"chengyu":"遛鸟侠","pinyin":"liùniǎoxiá","english_explanation":"(Taiwan) streaker"},{"chengyu":"那壶不开提那壶","pinyin":"nǎ hú bù kāi tí nǎ hú","english_explanation":"to air somebody's dirty laundry"},{"chengyu":"邯郸学步","pinyin":"Hándān xuébù","english_explanation":"to badly imitate others, and lose one's individuality in the process"},{"chengyu":"郁郁不乐","pinyin":"yùyù bùlè","english_explanation":"to be depressed; to be unhappy"},{"chengyu":"郑人买履","pinyin":"zhèngrénmǎilǚ","english_explanation":"a person who rigidly adheres to rules and regulations (or established convention), while at the same time ignoring the reality of a situation"},{"chengyu":"酒后吐真言","pinyin":"jiǔhòutǔzhēnyán","english_explanation":"Literally: One spits out the truth after drinking alcohol. In wine there is truth."},{"chengyu":"里外不是人","pinyin":"lǐ wài bùshì rén","english_explanation":"unable to make anybody happy; please none of them这件事你还是别插手吧！免得到最后里外不是人，好心没好报。I wouldn't get involved in this if I were you! You'll try to please all of them, but in the end, you'll please none of them."},{"chengyu":"里应外合","pinyin":"lǐ yìng wài hé","english_explanation":"to work from the inside in coordination with elements from the outside"},{"chengyu":"重于泰山","pinyin":"zhòng yú Tàishān","english_explanation":"more weighty (and important) than Mount Tai"},{"chengyu":"重于泰山，轻于鸿毛","pinyin":"zhòng yú Tàishān, qīng yú hóngmáo","english_explanation":"(Some deaths are) more weighty than Mount Tai, (while others are) lighter (and less significant) than a wild goose feather."},{"chengyu":"重枣","pinyin":"zhòngzǎo","english_explanation":"(literary) the color of dark jujube fruit; dark red"},{"chengyu":"量入为出","pinyin":"liàng rù wéi chū","english_explanation":"make ends meet; adjust one's expense to one's income; base one's expenditures upon one's income2005: Shenzhen Business News staff, Shenzhen Business News年轻白领理财的首要是要量入为出，强制储蓄。The most important thing for young white-collar workers, in terms of managing money, is to make ends meet and to focus on saving."},{"chengyu":"金刚不坏之身","pinyin":"jīn'gāng bù huài zhī shēn","english_explanation":"a strong and sturdy body"},{"chengyu":"金屋藏娇","pinyin":"jīnwū cáng jiāo","english_explanation":"^ August 27, 156 BCE"},{"chengyu":"金枝玉叶","pinyin":"jīn zhī yù yè","english_explanation":"delicate and rare branches and leaves"},{"chengyu":"金玉良言","pinyin":"jīnyù liángyán","english_explanation":"invaluable advice; a golden saying"},{"chengyu":"金碧辉煌","pinyin":"jīn bì huīhuáng","english_explanation":"(of the furnishings and decorations of a building or structure) magnificent, splendid and resplendent"},{"chengyu":"金蝉脱壳","pinyin":"jīnchántuōqiào","english_explanation":"to be able to escape from a (normally sticky) situation without other pertinent parties noticing it"},{"chengyu":"金鼓喧天","pinyin":"jīngǔ xuāntiān","english_explanation":"the clamor of gongs and drums resounded to the heavens"},{"chengyu":"金鼓齐鸣","pinyin":"jīngǔ qí míng","english_explanation":"the gongs and drums of war sound out in unison"},{"chengyu":"针锋相对","pinyin":"zhēn fēng xiāng duì","english_explanation":"toe-to-toe to go toe-to-toe with somebody in action. OR to write/speak toe-to-toe with some issue."},{"chengyu":"钿合金钗","pinyin":"diànhé jīnchāi","english_explanation":"(literary) inlaid box and golden hairpin"},{"chengyu":"铁证如山","pinyin":"tiězhèng rú shān","english_explanation":"a mountain of solid evidence; irrefutable"},{"chengyu":"铤而走险","pinyin":"tǐng ér zǒu xiǎn","english_explanation":"to risk danger in desperation; to make a reckless move; to be forced to break the law"},{"chengyu":"银河落九天","pinyin":"yínhé luò jiǔtiān","english_explanation":"describes the way a waterfall's water comes down"},{"chengyu":"铺霜涌雪","pinyin":"pū shuāng yǒng xuě","english_explanation":"rapidly and continually increasing in number"},{"chengyu":"锄强扶弱","pinyin":"chú qiáng fú ruò","english_explanation":"to suppress the strong and aid the weak"},{"chengyu":"锋不可当","pinyin":"fēng bù kě dàng","english_explanation":"(they) cannot be stopped; to be an unstoppable force"},{"chengyu":"长他人志气，灭自己威风","pinyin":"zhǎng tārén zhìqì, miè zìjǐ wēifēng","english_explanation":"to help the opposition's aspirations, while undermining one's own power and prestige; aiding the enemy"},{"chengyu":"长吁短叹","pinyin":"chángxūduǎntàn","english_explanation":"to utter sighs and groans; to moan and groan"},{"chengyu":"长生不老","pinyin":"chángshēng bù lǎo","english_explanation":"never get old; live forever; ageless; immortal"},{"chengyu":"门当户对","pinyin":"méndānghùduì","english_explanation":"(Advanced Mandarin) to be well matched in social and economic status (for purposes of marriage)"},{"chengyu":"闭门造车","pinyin":"bì mén zào chē","english_explanation":"do something irrespective of external circumstances; to operate in a vacuum2006: 宇争 (Yu Zheng), 中肯提出意见 姚明:请别再闭门造车 (Yao Ming's opinion hits home: \"Please don't operate in a vacuum anymore\")在中国男篮败在希腊队脚下后，姚明并没有发火，而是中肯地提出了自己的意见，他说：“闭门造车打国内的联赛永远都是这样，必须让他们出去打比赛，不是一个一个队的出去，而是一个一个队员的出去，杀入外面每一个队。这样，我们的篮球整体水平才有可能提高。”After the men's basketball team for China lost at the hands of Greece, Yao Ming did not become angry. Instead, he offered his own opinion, which cut right to the heart of the matter, \"It will always be like this if we operate in a vacuum, and are forever only playing local league games in our own country. We need to let them go abroad to compete. It's not about individual teams going abroad. Rather, it's about individual team members going abroad and fighting their way onto the teams of other countries. That's the only way we'll be able to raise the level of our basketball as a whole."},{"chengyu":"闷声不响","pinyin":"mēnshēngbùxiǎng","english_explanation":"to not say a word; to keep silent"},{"chengyu":"闻鸡起舞","pinyin":"wén jī qǐ wǔ","english_explanation":"be a go getter; be a self-starter"},{"chengyu":"阿狗阿猫","pinyin":"āgǒuāmāo","english_explanation":"(pejorative) any Tom, Dick or Harry; anyone and everyone"},{"chengyu":"阿猫阿狗","pinyin":"āmāoāgǒu","english_explanation":"(pejorative) any Tom, Dick or Harry; anyone and everyone2005, Hua Ming (华明) ed., 春节改期：传统面前的自作聪明我们要明白这样一个道理，世上没有绝对完美的安排，想为某个安排挑几个毛病出来是阿猫阿狗都能干的事We should know that there is no such thing as a perfect plan; any Tom, Dick or Harry can find a few faults along the way."},{"chengyu":"随时随地","pinyin":"suíshísuídì","english_explanation":"at any given time and in any given place"},{"chengyu":"随机应变","pinyin":"suíjīyìngbiàn","english_explanation":"to adjust to changing circumstance; to act according to circumstances"},{"chengyu":"隔靴搔癢","pinyin":"gé xuē sāoyǎng","english_explanation":"to attempt an ineffective solution"},{"chengyu":"雍容大方","pinyin":"yōngróng dàfāng","english_explanation":"dignified; poised"},{"chengyu":"雨集","pinyin":"yǔjí","english_explanation":"(literary) (people) gathered together in great numbers"},{"chengyu":"雪上加霜","pinyin":"xuě shàng jiā shuāng","english_explanation":"to add insult to injury"},{"chengyu":"零蛋","pinyin":"língdàn","english_explanation":"(slang) a zero (a terrible score)"},{"chengyu":"雷厉风行","pinyin":"léi lì fēng xíng","english_explanation":"(to carry out orders, policies etc.) vigorously and speedily; vigorously and resolutely"},{"chengyu":"雷声大，雨点小","pinyin":"léi shēng dà, yǔ diǎn xiǎo","english_explanation":"much said but little done"},{"chengyu":"雷打不动","pinyin":"léi dǎ bù dòng","english_explanation":"one's mind is made up, and cannot be changed"},{"chengyu":"青史传名","pinyin":"qīngshǐ chuánmíng","english_explanation":"one's name will be passed down in history books"},{"chengyu":"青天白日满地红","pinyin":"qīngtiān báirì mǎndì hóng","english_explanation":"a nickname for the flag of the Republic of China"},{"chengyu":"青红皂白","pinyin":"qīnghóng zàobái","english_explanation":"wheat and chaff; right and wrong"},{"chengyu":"青面獠牙","pinyin":"qīngmiànliáoyá","english_explanation":"green-faced and long-toothed; terrifying in appearance"},{"chengyu":"非...不可","pinyin":"fēi...bùkě","english_explanation":"Indicates that something is bound to happen or something will certainly happen.今天非下雨不可。Jīntiān fēi xiàyǔ bùkě.It will certainly rain today."},{"chengyu":"非...才...","pinyin":"fēi...cái...","english_explanation":"must; should; it is necessary or imperative非得作才行It must be done"},{"chengyu":"面善心狠","pinyin":"miànshàn xīnhěn","english_explanation":"(literary) a wolf in sheep's clothing"},{"chengyu":"面如冠玉","pinyin":"miàn rú guānyù","english_explanation":"describes a man that has a striking or handsome face"},{"chengyu":"面如土色","pinyin":"miàn rú tǔ sè","english_explanation":"to look ashen; to look pale"},{"chengyu":"面如重枣","pinyin":"miàn rú zhòngzǎo","english_explanation":"describes a face which is as red as the color of dark jujube fruit"},{"chengyu":"面恶心善","pinyin":"miàn è xīn shàn","english_explanation":"wicked face but a kind heart"},{"chengyu":"面面俱到","pinyin":"miànmiàn jù dào","english_explanation":"(Advanced Mandarin) attending to each and every aspect of a matter; thorough"},{"chengyu":"面面相觑","pinyin":"miànmiàn xiāng qù","english_explanation":"to look at each other (in fear) without knowing what to do; to look at each other in blank dismay"},{"chengyu":"韬光养晦","pinyin":"tāoguāngyǎnghuì","english_explanation":"to hide one's talents, and bide one's time for the right opportunity"},{"chengyu":"顶天立地","pinyin":"dǐng tiān lì dì","english_explanation":"fiercely independent; of indomitable spirit; fear nothing on earth; undertake a Herculean task; upstanding and dauntless"},{"chengyu":"顺我者生，逆我者死","pinyin":"shùn wǒ zhě shēng, nì wǒ zhě sǐ","english_explanation":"you're either with me or you're against me; it's my way or the highway"},{"chengyu":"顾不得许多","pinyin":"gù bùdé xǔduō","english_explanation":"incapable of focusing on too many things at once"},{"chengyu":"顾全大局","pinyin":"gùquándàjú","english_explanation":"(Advanced Mandarin) to take the interests of the whole into account; to take the situation as a whole into consideration"},{"chengyu":"顾名思义","pinyin":"gùmíngsīyì","english_explanation":"as the name implies"},{"chengyu":"顾左右而言他","pinyin":"gù zuǒyòu ér yán tā","english_explanation":"to try and change the subject"},{"chengyu":"颓墙坏壁","pinyin":"tuí qiáng huài bì","english_explanation":"dilapidated walls"},{"chengyu":"颠沛流离","pinyin":"diānpèiliúlí","english_explanation":"to wander about in a desperate plight; to be destitute and homeless她从此过上了颠沛流离的生活。From now on she'll lead the life of a vigrant."},{"chengyu":"风和日丽","pinyin":"fēng hé rì lì","english_explanation":"the bright sunshine and gentle breezes; warm and sunny weather"},{"chengyu":"风流倜傥","pinyin":"fēngliú tìtǎng","english_explanation":"(of one's appearance and manner) natural and unrestrained; charming; casual and elegant bearing; dashing"},{"chengyu":"风韵犹存","pinyin":"fēngyùn yóu cún","english_explanation":"(said of a middle-aged woman) still attractive"},{"chengyu":"风餐露宿","pinyin":"fēngcānlùsù","english_explanation":"to endure the hardship of living and travelling out in the wild"},{"chengyu":"飞沙走石","pinyin":"fēi shā zǒu shí","english_explanation":"sand flying about and stones hurtling through the air"},{"chengyu":"飞砂走石","pinyin":"fēishā zǒu shí","english_explanation":"dust and sand flying every which way (because of the wind)"},{"chengyu":"飞走如风","pinyin":"fēi zǒu rú fēng","english_explanation":"to run like the wind; to run very fast"},{"chengyu":"食之无味，弃之可惜","pinyin":"shí zhī wú wèi, qì zhī kěxī","english_explanation":"some things have no apparent value, but one still can't bear to throw them away2005: anon., www.tynews.com.cn李嘉诚心有不甘弃20年梦想 食之无味弃之可惜Li Jia sincerely did not wish to let go of a twenty year dream of his, he just could not bear to part with it."},{"chengyu":"食肉寢皮","pinyin":"shí ròu qǐn pí","english_explanation":"bitterly (detest)"},{"chengyu":"饮水思源","pinyin":"yǐn shuǐ sī yuán","english_explanation":"(Advanced Mandarin) to remember where one's happiness comes from"},{"chengyu":"首屈一指","pinyin":"shǒu qū yī zhǐ","english_explanation":"first2006: anon., www.chinainfo.gov.cn开通网络共享救助信息，这一做法不仅在成都尚属首次，在全国也是首屈一指。 (simp.) 開通網路共享救助訊息，這一做法不僅在成都尚屬首次，在全國也是首屈一指。 (trad.)Not only is this a first for Chengdu in terms of sharing help information over the net, it is the first in the country."},{"chengyu":"马不及鞍","pinyin":"mǎ bùjí ān","english_explanation":"in a hurry"},{"chengyu":"骨鲠在喉","pinyin":"gǔgěng zài hóu","english_explanation":"to feel compelled to speak up about something"},{"chengyu":"高下在心","pinyin":"gāoxià zài xīn","english_explanation":"to wield a great amount of power, and to reward or punish subordinates at one's whim"},{"chengyu":"高枕无忧","pinyin":"gāozhěn wú yōu","english_explanation":"to rest easy; to relax and not worryc. 1330 - 1400: Luo Guanzhong, Romance of the Three Kingdoms/Chapter 5卓大喜曰：「吾有奉先，高枕无忧矣！」Zhuo was overjoyed, and said, \"I have Fengxian, so I can rest easy!2002: Zhang Yimou (director), Hero (a movie starring Jet Li)长空、飞雪、残剑这三名赵国刺客十年来谋刺我王。令我王一日不得安睡。怎料今日却被我大秦壮士一举击破？从此我王可以高枕无忧了！Sky, Snow and Broken Sword. For ten years these three assassins from Zhao have repeatedly plotted to kill his majesty, so he has not known a single peaceful night's sleep. Today we discover that a hero from our great kingdom of Qin has single-handedly wiped out the enemy. From now on his majesty can once more sleep without fear! (from Quentin Tarantino DVD release)"},{"chengyu":"鬼也不上门","pinyin":"guǐ yě bù shàng mén","english_explanation":"not even a ghost came; nobody was there"},{"chengyu":"鬼影幢幢","pinyin":"guǐ yǐng chuángchuáng","english_explanation":"spooky"},{"chengyu":"鬼鬼祟祟","pinyin":"guǐguǐsuìsuì","english_explanation":"furtive; sneaking; stealthy"},{"chengyu":"魂不附体","pinyin":"hún bù fù tǐ","english_explanation":"to be so scared or shocked that one practically leaps out of one's skin"},{"chengyu":"魂飞天外","pinyin":"hún fēi tiān wài","english_explanation":"to practically leap out of one's skin (with shock or surprise)"},{"chengyu":"鱼死网破","pinyin":"yúsǐwǎngpò","english_explanation":"to fight till both you and your foe perish"},{"chengyu":"鸡同鸭讲","pinyin":"jī tóng yā jiǎng","english_explanation":"mutually unintelligible; unable to understand one another"},{"chengyu":"鸡毛当令箭","pinyin":"jīmáo dàng lìngjiàn","english_explanation":"to treat one's superior's casual remarks as an order and to make a big fuss about it"},{"chengyu":"鸡犬不惊","pinyin":"jī quǎn bù jīng","english_explanation":"a well-disciplined army (i.e. an army that is so disciplined, it doesn't startle the chickens and dogs of the enemy)"},{"chengyu":"鸡皮鹤发","pinyin":"jīpí hèfǎ","english_explanation":"(said of the aged) with shriveled skin and white hair"},{"chengyu":"鸡蛋里挑骨头","pinyin":"jīdàn lǐ tiāo gǔtóu","english_explanation":"nitpicky"},{"chengyu":"鸣金收军","pinyin":"míngjīn shōu jūn","english_explanation":"to bang war gongs as a signal to retreat"},{"chengyu":"鹏程万里","pinyin":"péng chéng wàn lǐ","english_explanation":"(said of a person) to have brilliant prospects; to have a bright future"},{"chengyu":"鹤发童颜","pinyin":"hèfà-tóngyán","english_explanation":"white hair and ruddy complexion; healthy in old age; hale and hearty"},{"chengyu":"黄鼠狼给鸡拜年","pinyin":"huángshǔláng gěi jī bàinián","english_explanation":"Greeks bearing gifts; a wolf in sheep's clothing"},{"chengyu":"黑马","pinyin":"hēimǎ","english_explanation":"(racehorses or persons with unexpected capabilities) a dark horse"},{"chengyu":"黯淡无光","pinyin":"àndànwúguāng","english_explanation":"Alternative form of 暗淡无光."},{"chengyu":"鼎足之势","pinyin":"dǐngzú zhī shì","english_explanation":"a triumvirate of forces; a tripartite force"},{"chengyu":"鼓洪炉燎毛发","pinyin":"gǔ hónglú liáo máofǎ","english_explanation":"(archaic) overkill; to go way overboard; to use a sledge hammer"},{"chengyu":"鼓瑟","pinyin":"gǔsè","english_explanation":"(literary) to play a se (an ancient type of zither)"},{"chengyu":"鼓舞人心","pinyin":"gǔwǔ rénxīn","english_explanation":"encouraging"},{"chengyu":"鼻子不是鼻子脸不是脸","pinyin":"bízi bù shì bízi liǎn bù shì liǎn","english_explanation":"(colloquial) to flare up; to be in a foul temper; in a bad mood; unhappy2006: Crystal (ed.), 序章：三、为什么要解聘员工正当猴子忙得昏天暗地之时，肥猫会突然提起猴子早就忘了的另外几件事，然后就鼻子不是鼻子脸不是脸的把猴子狠狠臭骂一顿。Just as the monkey was dazed and confused, the fat cat suddenly mentioned something he had forgotten, whereupon the fat cat got ticked off and ruthlessly started to abuse him."},{"chengyu":"鼻子气歪了","pinyin":"bízi qì wāi le","english_explanation":"(colloquial) pissed off; furious"},{"chengyu":"齐心戮力","pinyin":"qíxīn lùlì","english_explanation":"everyone will do their utmost to accomplish something"},{"chengyu":"龙盘虎踞","pinyin":"lóng pán hǔ jù","english_explanation":"a location that is forbidding and dangerous"},{"chengyu":"龙蟠虎踞","pinyin":"lóng pán hǔ jù","english_explanation":"describes a location that is forbidding and dangerous"},{"chengyu":"龙行虎步","pinyin":"lóng xíng hǔ bù","english_explanation":"(to walk) in a dignified and confident manner; displaying the dignity of an emperor"},{"chengyu":"龙骧虎步","pinyin":"lóng xiāng hǔbù","english_explanation":"a mighty and awe-inspiring bearing"}]